{
  "heroes": [
    {
      "ID": 1,
      "Name": "Earthshaker",
      "imgURL": "./img/Earthshaker_icon.png",
      "Info": "Earthshaker is a powerful spellcaster designed to repeatedly stun enemies. However, his naturally low mana requires careful management and selective use, especially during the early game.",
      "Summary": "Raigor Stonehoof, the Earthshaker, is a melee strength hero with several area of effect (AoE) disables, commonly played as a ganker or initiator. Good usage of his spells allow him to damage and chainstun multiple enemies at once, making him very disruptive in skirmishes and teamfights. His Fissure is a versatile long-ranged spell that affects enemies in a line, used to stun, inflict moderate damage, and create an impassable wall of earth for a significant duration. Proper usage of this can allows him to cut off chokepoints, leaving enemies with no escape routes or preventing them from chasing after endangered allies. Enchant Totem massively boosts his attack damage for one attack, and has a very short cooldown. Aftershock lets the Earthshaker deal additional damage and stun in a small area around him every time he uses one of his spells, and combos particularly well with Enchant Totem, given the former's very low cooldown. Earthshaker's heavy AoE-centric kit is most powerful when his enemies are in large numbers and in close proximity. With his Echo Slam, he can deal heavy damage to clusters of enemies. All of Earthshaker's spells (with the exception of his ultimate) have a long casting animation, but with proper positioning, an adept Earthshaker can wreak havoc. Blink Dagger is an essential item for him to be able to properly land Echo Slam within a cluster of enemies. At the same time, because of the high mana costs of his spells, he needs some form of mana sustenance. With his tremendous seismic power, the Earthshaker is never one that should be taken lightly even when he is heavily outnumbered.", 
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 310,
        "MaxDmg": 56,
        "MinDmg": 46,
        "HP": 598,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.68,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 12,
        "BaseInt": 16,
        "StrGain": 2.9,
        "AgiGain": 1.4,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.467,
        "AttackSwing": 0.863,
        "CastPoint": 0.65,
        "CastSwing": 0.5,
        "Turnrate": 0.9,
        "Legs": 2
      }
    },
    {
      "ID": 2,
      "Name": "Sven",
      "imgURL": "./img/Sven_icon.png",
      "Info": "Sven is the embodiment of strength, a mighty front line fighter capable of dealing tremendous physical damage to groups of foes at once.",
      "Summary":"Sven, the Rogue Knight, is a versatile melee strength hero with superior physical power coupled with powerful utility abilities. He can fulfill various roles, but is often played as a semi-carry due to his high utility even without items. He possesses a versatile arsenal, from Warcry, which grants armor that can be used for escaping as well as pushing, to the throwable Storm Hammer that stuns enemies around the targeted unit. With enough items, Sven has the potential to be a strong late-game carry due to his ultimate, which increases his damage, making him hit up to three times as hard, which can then be used in conjunction with his Great Cleave to secure multiple kills with just a few swings of his sword. This immense power granted to him solely by his ultimate makes him one of strongest late-game carries in the game, and arguably the strongest semi-carry of all, as his killing presence remains even if he decides to build more supportive and tanky utility items. A truly frightening enemy to go up against if farmed, strong and versatile, Sven is a solid addition to almost every team composition.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 66,
        "MinDmg": 64,
        "HP": 617,
        "Mana": 182,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.94,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 21,
        "BaseInt": 16,
        "StrGain": 2.7,
        "AgiGain": 2,
        "IntGain": 1.3,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.3,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 3,
      "Name": "Tiny",
      "imgURL": "./img/Tiny_icon.png",
      "Info": "Tiny is a heavy carry with a large amount of health. He is the only hero in the game that grows as he levels up",
      "Summary":"Tiny, the Stone Giant, is a melee strength hero with powerful ganking and killing potential. Although he starts off vulnerable in lane with his pitiful mana pool and non-existent armor, with a few levels, he gets considerably stronger. His killing power in the early and midgame comes from combo-ing his two active abilities. Avalanche engulfs an area in a wave of stones, dealing respectable damage and stunning enemies, while Toss allows Tiny to pick up the closest unit near himself and launch it at the designated location, dealing damage to all enemies at the location as well as additional damage to the thrown unit if an enemy. It can be used to displace an ally within the enemy team, but is mostly used on enemies themselves to deliver massive damage. If chained immediately with Avalanche, it also doubles the damage the target takes from Avalanche, allowing Tiny to easily dispatch fragile enemy heroes in a matter of seconds. Although his nuking potential with his active abilities is already considerable, his passive Grow turns Tiny into a formidable physical combatant as well. Grow increases Tiny's size and provides him with a massive boost to his attack damage, movement speed, and status resistance, at the cost of some attack speed. Although Tiny initially lives up to his name by starting off small and weak, much like an avalanche, he quickly grows in size and strength until he becomes a hulking behemoth with enormous health and damage output. This gives Tiny the potential to become one of the strongest carries in late game situations.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 285,
        "MaxDmg": 67,
        "MinDmg": 61,
        "HP": 636,
        "Mana": 182,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.54,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 26,
        "BaseAgi": 9,
        "BaseInt": 17,
        "StrGain": 3,
        "AgiGain": 0.9,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.49,
        "AttackSwing": 1,
        "CastPoint": 0.001,
        "CastSwing": 0,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 4,
      "Name": "Kunkka",
      "imgURL": "./img/Kunkka_icon.png",
      "Info": "Kunkka is a strategic fighter that relies on his carefully placed abilities to disrupt enemy formations. His skills complement one another, and need to be used in conjunction to be effective.",
      "Summary":"Kunkka, the Admiral, is a versatile melee strength hero built with an arsenal of powerful area-of-effect (AoE) spells. Two of his active spells are nukes that have long delay times, but can disable and disrupt the enemies' position. He is mostly played as a carry, initiator, or even as a ganking support. Kunkka is known for his Tidebringer sword, giving him the ability to cleave a large area around him with heavy potential damage on his next attack, which refreshes at a given period of time. Torrent calls upon the element of water to rise and burst out, dealing damage, disabling them up high, and slowing them on impact. There's a delay on this ability before it activates, so Kunkka must be wise in using this ability. X Marks the Spot targets any hero or Kunkka himself to be marked on their current position, and after a given time delay, instantly returns to the marked spot. Useful in setting up tricky spells, escape prevention, or even saving allies, X Marks the Spot makes the Admiral a great battle strategist. His ultimate lets him summon a Ghostship, which travels on ground, until it crashes a set distance away, stunning and damaging enemies on that location – potentially crippling the enemy team. The Ghostship also bolsters allies with Kunkka's Rum, granting them bonus movement speed and temporary numbness to damage. Capable of inflicting high burst damage with his spells, controlling their position while being able to survive the mayhem when his spells are used properly, Kunkka is a mighty offensive team fighter, built with strong physical and magical damage output, who can indeed turn the tide of a battle.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 57,
        "MinDmg": 47,
        "HP": 636,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.96,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 24,
        "BaseAgi": 14,
        "BaseInt": 18,
        "StrGain": 3,
        "AgiGain": 1.3,
        "IntGain": 1.5,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.3,
        "CastPoint": 0.4,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 5,
      "Name": "Beastmaster",
      "imgURL": "./img/Beastmaster_icon.png",
      "Info": "Beastmaster is a utility hero that brings many benefits to his team, such as clearing trees with Wild Axes. His scouting Hawk functions like a moving ward, and his Beastmaster Boar slows down enemies with ranged attacks.",
      "Summary":"Karroch, the Beastmaster, is a versatile melee strength hero most commonly played as an offlaner and ganker who brings a good amount of utility to his team in any situation. His Wild Axes allows him to lane and farm quite effectively throughout the game, even when pressured. He is able to summon a hawk and boar to aid him, each providing a good amount of utility to his team. Hawks provide free flying vision around the map, scouting his enemies while his Boars can harass and slow his enemies to a crawl while aiding him in combat. His Inner Beast aura makes his team a force to be reckoned with, providing a hefty boost to attack speed to himself, his summons, and all nearby allies. Finally, his ultimate, Primal Roar, is the longest lasting single-target reliable stun in the game and also penetrates spell immunity (being only counterable by Linken's Sphere), providing a strong initiation for his team to claim a kill. With these skills, he can push enemy towers quickly and safely, take down undefended targets with the help of Necronomicon summons, lock down a single target, and also kite enemies in teamfights. With careful observation of the battlefield, Beastmaster takes down enemies one by one and paves the way to victory.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 310,
        "MaxDmg": 68,
        "MinDmg": 64,
        "HP": 617,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 18,
        "BaseInt": 16,
        "StrGain": 2.2,
        "AgiGain": 1.6,
        "IntGain": 1.9,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.5,
        "CastSwing": 0.5,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 6,
      "Name": "Dragon Knight",
      "imgURL": "./img/Dragon_Knight_icon.png",
      "Info": "Dragon Knight is a durable front-line carry who can transform into a dragon and wipe out enemies with ranged projectile attacks. His heavy armor and regeneration from Dragon Blood makes him tankier than most carries, especially in the early game.",
       "Summary":"Davion, the Dragon Knight, is a durable melee strength hero with a relatively straightforward and yet versatile skill set. He has both an area-of-effect nuke and a lengthy single-target stun, giving him excellent farming and ganking capabilities. Though he has no real escape ability, his Dragon Blood provides him a hefty amount of armor and regen, making him capable of withstanding strong physical hits and recovering quickly. He is still very vulnerable in the early game, however, and needs to farm and stay alive in order to be effective in later stages. If he has enough levels and farm, Dragon Knight is very formidable in the late game due to his strong ultimate, Elder Dragon Form, which transforms him into a legendary dragon with a ranged attack, capable of eliminating multiple enemies at once.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 52,
        "MinDmg": 46,
        "HP": 541,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.66,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 19,
        "BaseAgi": 19,
        "BaseInt": 15,
        "StrGain": 2.8,
        "AgiGain": 2.2,
        "IntGain": 1.7,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 7,
      "Name": "Clockwerk",
      "imgURL": "./img/Clockwerk_icon.png",
      "Info": "Clockwerk is a tanky initiator and ganker built to isolate and separate enemies. His array of disables and nukes provide strong crowd control in any situation, allowing him to greatly disrupt the enemy.",
              "Summary":"Rattletrap, the Clockwerk, is a melee strength hero known as being one of the most well-rounded initiator-gankers in the game. Rattletrap's wide array of disables and nukes allows him to cause chaos among the enemy team and break up their formation, giving his team a powerful advantage in any fight. Battery Assault allows Clockwerk to inflict repeated damage ticks and mini-stuns on nearby enemies, allowing him to constantly hinder any enemies he manages to get close to and single out. He can also disrupt enemy movement and pen in foes with his Power Cogs, which induces an electric shock to foes outside, stunning them while damaging them and burning their mana, and can render enemies caught inside helpless. His damage nuke, Rocket Flare, gives him global nuking power that also provides scouting vision for him and his team. Finally, his ultimate, Hookshot, allows Rattletrap to instantaneously latch onto and stun a foe from long range, making him a very strong ganker. Few can escape Clockwerk once he has his sights locked in, and his machinations make him a powerful ally to have on any team.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 57,
        "MinDmg": 55,
        "HP": 636,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.82,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 24,
        "BaseAgi": 13,
        "BaseInt": 17,
        "StrGain": 2.9,
        "AgiGain": 2.3,
        "IntGain": 1.3,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.33,
        "AttackSwing": 0.64,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 8,
      "Name": "Omniknight",
      "imgURL": "./img/Omniknight_icon.png",
      "Info": "Omniknight is a defensive support who specializes in healing his allies with Purification icon.png Purification and shielding them from damage with Repel and Guardian Angel.",
      "Summary":"Purist Thunderwrath, the Omniknight, is a melee strength hero who is renowned for his ability to protect his allies, preventing the enemy from easily killing them. A holy and courageous hero, Purist Thunderwrath is an adept support whose powerful spells give his team strong survivability. He possesses a potent healing ability in Purification, which can instantly heal the targeted ally and, if there are nearby enemy units, deal pure damage in the same amount, allowing it to be used as a nuke. He is also capable of providing spell immunity to allies in the form of Repel, a basic ability that prevents himself or allies from being affected by most enemy spells. His passive ability, Degen Aura, can greatly slow the movement and attack speed of enemies, preventing them from easily using their physical attacks to deal damage. And finally, his ultimate, Guardian Angel, can provide complete immunity against physical damage to all nearby allies, completely nullifying the damage output of most carries for a short time. Few can escape the mighty and heavenly power of the Omniknight and he is a powerful ally in team fights. He is a mighty tank, and a very difficult hero to kill.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 61,
        "MinDmg": 51,
        "HP": 560,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 5.1,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 20,
        "BaseAgi": 15,
        "BaseInt": 17,
        "StrGain": 2.65,
        "AgiGain": 1.75,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.433,
        "AttackSwing": 0.567,
        "CastPoint": 0.5,
        "CastSwing": 1.67,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 9,
      "Name": "Huskar",
      "imgURL": "./img/Huskar_icon.png",
      "Info": "Huskar is a resilient ranged attacker who sacrifices his own health to inflict greater damage. An injured Huskar attacks with incredible speed, making him frustratingly hard to kill even at the brink of death.",
      "Summary":"Huskar the Sacred Warrior is a ranged strength hero who is an effective ganker and carry, with both great benefits and risks offered. He is known to be a powerful adversary in most games because his damage-per-second auto-attacks can easily kill almost all heroes at any point in the game, assuming no one is nearby to save them. Unlike many other heroes, Huskar does not require much mana to use his abilities; rather, he sacrifices his own health to inflict additional damage. His passive, Berserker's Blood, defines the power of sacrifice: Huskar gets more dangerous the more he gets hurt. This ability gives him increased magic resistance and attack speed depending on how much life he is missing. Combined with the DPS from Burning Spear, the increased attack speed from Berserker's Blood allows Huskar to output colossal damage, which can be used to gain an advantage over the enemies early on during the game. Inner Vitality magically heals Huskar or his allies, regenerating health each second based upon the target's primary attribute, and healing more when the health is at a critical level. His Life Break is his most dangerous ability, but also his riskiest one: charging towards his target, Huskar sheds a large amount of his life force to cut an equal amount of the target's current health. This is great to use as an initiation spell as it deals a guaranteed percentage damage, allowing Huskar and his allies to feel the pain that the Sacred Warrior felt. Courageous and fearless, Huskar is powerful at any stage of the game and is willing to suffer and face death, for the greater good of taking his allies to victory.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 51,
        "MinDmg": 42,
        "HP": 579,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 400,
        "ProjectileSpeed": 1400,
        "BaseStr": 21,
        "BaseAgi": 15,
        "BaseInt": 18,
        "StrGain": 2.4,
        "AgiGain": 1.4,
        "IntGain": 1.5,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.6,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 2.4,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 10,
      "Name": "Alchemist",
      "imgURL": "./img/Alchemist_icon.png",
      "Info": "Alchemist Alchemist is a formidable carry capable of amassing large amounts of gold, and sustaining himself almost indefinitely during teamfights.",
      "Summary":"Razzil Darkbrew, the Alchemist, is a melee strength hero whose alchemical prowess makes him a strange but versatile fighter. He is an unusual carry based upon transmuting killed creeps into large amounts of bonus gold, with both an early game and late game presence due to the enormous health regeneration from his ultimate and the first strike nature of his other spells. His low but balanced attributes and the sure promise of gold for items means he can be one of the most disparately built heroes in the game. Unstable Concoction is his main contribution early on, dealing good damage and a lengthy stun. Acid Spray allows him to rapidly clear waves of creeps for his Greevil's Greed to contribute massive amounts of extra income. A well-equipped Alchemist can then use Chemical Rage to its fullest effect, as the incredible regeneration and base attack time reduction make it one of the best steroid abilities in the game.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 58,
        "MinDmg": 49,
        "HP": 655,
        "Mana": 325,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.54,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 25,
        "BaseAgi": 11,
        "BaseInt": 25,
        "StrGain": 1.8,
        "AgiGain": 1.2,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.65,
        "CastPoint": 0.4,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 4
      }
    },
    {
      "ID": 11,
      "Name": "Brewmaster",
      "imgURL": "./img/Brewmaster_icon.png",
      "Info": "Brewmaster is an unpredictable brawler who sows disarray among enemy formations. With the help of a Blink Dagger, he jumps in to initiate with Thunder Clap, then divides into three elemental beings with Primal Split.",
      "Summary":"Mangix the Brewmaster is a melee strength hero that can fill almost any role, though he is primarily seen as a carry, ganker, tank or initiator. He fits well into any lane, but is very experience dependent, which means he is often seen on the offlane or the midlane. His core abilities make him a respectable physical damage dealer and an especially good duelist since he has abilities that involve negating opposing auto-attacks while strengthening his own. However, his true power lies in his ultimate, Primal Split, which, if used properly, can by itself turn the tide of a team fight. Each of the three aspects of the Brewmaster are exceptionally powerful, with exceptional disables, survivability against magic and physical attacks, and damage; they are also able to charge recklessly into the enemy since the damage they take is not permanent, and very rarely will all three die before Primal Split ends. For this reason, Brewmaster is almost always built to fully maximize the potential of this ultimate, getting items such as Blink Dagger so that he can combo into his ultimate without risk of being initiated on, Heart of Tarrasque to ensure he can survive the first wave of stuns and burst in order to cast his ultimate, and of course Aghanim's Scepter to give his spirits his abilities, Thunder Clap to Earth, Drunken Haze to Storm, and Drunken Brawler to Fire, all independent of the original Brewmaster's cooldowns for his abilities.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 59,
        "MinDmg": 52,
        "HP": 617,
        "Mana": 182,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 2,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 22,
        "BaseInt": 14,
        "StrGain": 2.9,
        "AgiGain": 1.95,
        "IntGain": 1.25,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.65,
        "CastPoint": 0.4,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 12,
      "Name": "Treant Protector",
      "imgURL": "./img/Treant_Protector_icon.png",
      "Info": "Treant Protector is a tough support hero who is able to protect and regenerate allies and friendly buildings with his trademark ability, Living Armor.",
      "Summary":"Rooftrellen, the Treant Protector, is a melee strength hero who excels in supporting and strengthening his allies with his beneficial set of spells, which use the power of nature. He is a natural tank, offensively and defensively, having both the highest natural attack damage and the second highest overall strength in the game. Manipulating the power of the plants to his will, he can grant invisibility and stealth to himself with Nature's Guise and move quickier with a stunning hit, being a good ganking skill and rather efficient for scouting, provided that he remains within close proximity to a tree. He can use Leech Seed to sap the life from a target, slowing and dealing moderate damage over time to it while nearby allies are replenished by the same amount. His signature Living Armor makes him truly live up his title, as he is able to provide allies and even friendly buildings with increased health regeneration and a massive damage block from anywhere on the map. Finally, his ultimate Overgrowth roots nearby enemies with vines, branches, and roots; though it does not deal any damage, it immobilizes them and renders them unable to attack for several crucial seconds. Although Rooftrellen is not able to dish out much damage outside of his regular attacks, he is able to provide an enormous amount of defensive utility and survivability to himself and his teammates, thereby planting the seeds for a decisive victory.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 89,
        "MinDmg": 81,
        "HP": 655,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 25,
        "BaseAgi": 15,
        "BaseInt": 17,
        "StrGain": 3.3,
        "AgiGain": 2,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.9,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.6,
        "AttackSwing": 0.4,
        "CastPoint": 0.5,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 13,
      "Name": "IO",
      "imgURL": "./img/Io_icon.png",
      "Info": "Io is a unique hero that provides boosts to its allies by linking to them. While relatively powerless alone, Io's powers amplify with appropriate heroes.",
      "Summary":"Io the Wisp is a ranged strength hero who works best as part of a communicative team. With its support-oriented skill set, Io is able to share its strength through Tether and Overcharge, harass enemy heroes out of the lane with Spirits, and materialize itself and an ally anywhere on the map with Relocate. Gank enemy heroes, push undefended lanes, save teammates from deep within enemy territory—the possibilities are endless, and Io features one of the highest skill ceilings in the game. Io, does not need to be facing towards a unit in order to attack, use abilities, or items. It still has a front, marked by an arc-like effect, and a back.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 52,
        "MinDmg": 43,
        "HP": 503,
        "Mana": 299,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": -0.04,
        "Range": 575,
        "ProjectileSpeed": 1600,
        "BaseStr": 17,
        "BaseAgi": 14,
        "BaseInt": 23,
        "StrGain": 1.9,
        "AgiGain": 1.6,
        "IntGain": 1.7,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.15,
        "AttackSwing": 0.4,
        "CastPoint": 0.001,
        "CastSwing": 0,
        "Turnrate": 0.7,
        "Legs": 0
      }
    },
    {
      "ID": 14,
      "Name": "Centaur Warrunner",
      "imgURL": "./img/Centaur_Warrunner_icon.png",
      "Info": "Centaur Warrunner is an aggressive tank who excels when he is placed in the middle of fights. He reflects damage with his passive ability Return, while stunning and attacking the area around him with Hoof Stomp and Double Edge.",
      "Summary":"Bradwarden, the Centaur Warrunner, is a melee strength hero whose natural place in combat is right in the center of battle. His abilities stop enemies around him in their tracks and inflict heavy damage, making him an excellent initiator. He is also a powerful tank, having the highest strength gain in the game. Bradwarden has immense natural health, and his skills' area of effect means that he can charge into combat and incapacitate groups of enemies at a time. Hoof Stomp and Double Edge make a great combo of stunning and burst damage on short cooldowns and his Return means instant retaliation on enemies who try attack him, as well as his nearby allies with the proper late-game talent. His ultimate, Stampede effectively turns the entire team into initiators, granting them high speed and the ability to flatten enemies under as they pass over them. Although he is usually not played as a carry, he can scale powerfully with items, becoming a hard-hitting semi-carry that is nearly impossible to kill.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 57,
        "MinDmg": 55,
        "HP": 617,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.1,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 15,
        "BaseInt": 15,
        "StrGain": 3.8,
        "AgiGain": 2,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.5,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 4
      }
    },
    {
      "ID": 15,
      "Name": "Timbersaw",
      "imgURL": "./img/Timbersaw_icon.png",
      "Info": "Timbersaw is an armored brawler who relies on cutting down trees as a mechanic for rapid movement and dealing damage. In the early and mid stages of the game can be surprisingly durable, staying in the fight and taking out multiple opponents even on the verge of death.",
      "Summary":"Rizzrack, the Timbersaw, is a melee strength hero that excels in dealing damage and causing destruction in large areas. His effectiveness is highly dependent on the presence of trees in the surrounding environment, as they can amplify the damage of his spells and allow him to escape and chase easily. He is not naturally very durable, having unusually low health for a strength hero and almost nonexistent armor from the start of the game, but becomes far more resilient when he has been repeatedly attacked due to his Reactive Armor, providing him both with a hefty amount of armor and regeneration. This can make him a huge nuisance to deal with in the early and midgame, when spell damage output is low from enemies and they are reliant on physical attacks to harass him. His three active abilities all have very low cooldowns and the capacity to deal pure damage, which is unreduced by magic resistance nor armor, making him a very destructive hero if left to his own devices. Whirling Death deals damage to enemies in a small area around him, and can hit for pure damage if a tree is cut down with its usage; it also lowers the primary attributes of the afflicted, being especially effective against enemy strength heroes as they lose a portion of their maximum health pool. Timber Chain serves as a multipurpose mobility and damage spell, allowing him to quickly close distant gaps between himself and enemies and escape, but requires a tree to latch onto. Finally his ultimate, Chakram, can deal considerable pure damage and slow all at a very low cooldown, but can be difficult to land. With proper positioning and timing, he can cause massive damage to multiple enemies all the while debilitating their attributes and movement.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 55,
        "MinDmg": 51,
        "HP": 598,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.24,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 16,
        "BaseInt": 21,
        "StrGain": 2.1,
        "AgiGain": 1.3,
        "IntGain": 2.4,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.36,
        "AttackSwing": 0.64,
        "CastPoint": 0.3,
        "CastSwing": 0.6,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 16,
      "Name": "Axe",
      "imgURL": "./img/Axe_icon.png",
      "Info": "Axe is a very strong initiator and disabler as he possesses an area disable capable of piercing spell immunity in Berserker's Call, and a low-cooldown slow in Battle Hunger that also boosts his movement speed. ",
      "Summary":"Mogul Khan, the Axe, is a melee strength hero, infamous for creating chaos in battle and thriving off of it. Axe is commonly played as an initiator, as his potent disables can disrupt the enemy's formation and give his team openings in fights. Axe's fighting style demands that he gets up close and very personal, as he can taunt enemies into attacking him with Berserker's Call, preventing them from engaging his teammates. Once he has the enemy's attention, he can counter those who strike him with a sweeping Counter Helix that slashes all enemies at melee range with pure damage. He also has a slow and damage-over-time nuke in Battle Hunger, which can harass the enemy or force them to join in battle, while also slowing their movement speed and boosting his own. Finally, he has the ability to unconditionally remove weakened enemies from the battlefield if they are under a certain threshold with Culling Blade, while simultaneously boosting his allies' speed. A bloodthirsty and indomitable warrior, Axe's presence on the battlefield is felt by friend and foe alike, dominating the attention of the enemy wherever he goes.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 53,
        "MinDmg": 49,
        "HP": 655,
        "Mana": 234,
        "HPRegen": 3,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 25,
        "BaseAgi": 20,
        "BaseInt": 18,
        "StrGain": 2.5,
        "AgiGain": 2.2,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 17,
      "Name": "Pudge",
      "imgURL": "./img/Pudge_icon.png",
      "Info": "Pudge is a fearsome ganker and one of the most popular and renowned heroes in all of Dota. Played skillfully, he can displace enemies and set up kills for his team that would be otherwise impossible to accomplish even from the early game.",
      "Summary":"Pudge, the Butcher, is a melee strength hero feared for his incredible ganking prowess and risky, yet potentially rewarding playstyle. Pudge is potentially one of the strongest gankers and disablers in the entire game, with his combo of three active abilities proving more than sufficient to kill fragile enemy heroes in the early and mid-game. His signature ability, Meat Hook, is a grapple that is thrown out in a straight line; if it snags a target, it will drag them back to Pudge, dealing enormous damage to it if it was an enemy. Although it can be difficult to land and often requires a good read on the enemy's movements, it is a very powerful ganking and initiation spell due to its ability to displace enemies, and also has the utility of being able to save an endangered ally. He can then follow up with his ultimate, Dismember, a channeled disable that deals further damage to the target over a few seconds and increases in lethality the more strength Pudge has, while also healing Pudge for its duration. During this period, he can activate Rot to deal even more damage while he is consuming his foe, and use it to slow and finish them off if they survive the initial assault. Rot is also a very potent ability even from the start of the game, as it can slow an enemy to a crawl and be used indefinitely as long as Pudge keeps pace with the enemy, making Pudge a strong roamer. To supplement his killing power is Flesh Heap, which provides him some magic resistance to reduce the damage he takes from Rot as well as from other enemy spells. The scariest aspect of Flesh Heap though, is that it provides him with a permanent strength bonus with every kill that he participates in, making him harder to kill and increasing the damage of Dismember as the game goes on. A skilled Pudge player is feared by many, as he can quickly snowball out of control, cripple the enemy team, and become an unstoppable behemoth of rotting flesh.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 285,
        "MaxDmg": 58,
        "MinDmg": 52,
        "HP": 655,
        "Mana": 182,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.96,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 25,
        "BaseAgi": 14,
        "BaseInt": 14,
        "StrGain": 3.2,
        "AgiGain": 1.5,
        "IntGain": 1.5,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 1.17,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.7,
        "Legs": 2
      }
    },
    {
      "ID": 18,
      "Name": "Sand King",
      "imgURL": "./img/Sand_King_icon.png",
      "Info": "Sand King is played as an initiator Hero with extremely powerful AoE damage, going from one-instance damage to damage over the time. All of his abilities can affect multiple enemies, deal damage and pack with them disables and strong disables.",
      "Summary":"Crixalis, the Sand King, is a melee strength hero with one of the highest area of effect (AoE) damage outputs in the entire game. All four of his abilities can affect multiple enemy units, and can combo quite well with each other. He is one of the most versatile Heroes in the game as he can push, initiate, support, gank, and even semi-carry if he does well. Late game his effectiveness diminishes as none of his abilities scale, but he can still function to support carries with Burrowstrike and Epicenter's slow. He is also versatile enough to be able to go to any lane with at least moderate success. He works well as a participant in a dual lane or trilane, but can also solo very effectively against melee enemies, since Caustic Finale discourages enemies from approaching the creeps. His main role in the team is to deliver a devastating initiation, delivering both stuns and slows to the enemy team. Crixalis is also very effective at escaping and dodging with two low cost, low cooldown abilities that disjoint projectiles and can escape enemy damage. Burrowstrike allows him to tunnel underground and resurface in a short line, dealing damage and stunning all targets it hits. Sand Storm is used as an escape mechanism and to do AoE damage. Caustic Finale serves as a strong harassing tool against enemy melee heroes or as a followup after he Burrowstrikes a creep wave, allowing him to farm quite effectively. Finally, his ultimate, after a short channeling time, delivers a vast amount of area of effect damage and slow centered around himself which necessitates a safe way to channel the ability like the purchase of a Blink Dagger.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 59,
        "MinDmg": 43,
        "HP": 522,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.66,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 19,
        "BaseInt": 16,
        "StrGain": 2.6,
        "AgiGain": 2.1,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.53,
        "AttackSwing": 0.47,
        "CastPoint": 0,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 6
      }
    },
    {
      "ID": 19,
      "Name": "Slardar",
      "imgURL": "./img/Slardar_icon.png",
      "Info": "He excels and thrives in close combat situations, and has high mobility, strong initiation and ganking abilities, and good synergy between his abilities",
      "Summary":"Slardar, the Slithereen Guard, is a melee strength hero who uses brute force, low cooldown spells, and high physical strength to bring his enemies to their knees. He excels and thrives in close combat situations, and has high mobility, strong initiation and ganking abilities, and good synergy between his abilities. Guardian Sprint greatly increases Slardar's movement speed for a lengthy duration, and allows him to chase down heroes, and escape with ease. It does increase the damage Slardar takes, so it must be used with extreme caution. Guardian Sprint can be used to get right next to enemies so Slardar can use Slithereen Crush, which delivers an area of effect (AoE) stun to nearby enemies followed by a minor slow afterwards, all on a very low cooldown. This allows Slardar to take on multiple opponents simultaneously and deliver a potent initiation. Bash of the Deep serves as a strong steroid ability, occasionally locking enemies in place while Slardar whacks at them with impunity. Finally, his ultimate Corrosive Haze is a great armor reduction modifier and allows him to reveal an enemy for its duration, making Slardar very potent against tanks and invisible heroes alike. It will also increase the damage dealt by his Crush and Bash, since they are physical. Although a strength hero, he has a high physical damage output, an agility gain and armor value, which rivals that of most agility heroes, allowing him to carry quite well if the situation calls for it. Chasing enemies relentlessly, pummeling them into the ground, and reducing their armor to shreds, Slardar is a fearsome opponent to face.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 59,
        "MinDmg": 51,
        "HP": 579,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 5.38,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 17,
        "BaseInt": 15,
        "StrGain": 2.8,
        "AgiGain": 2.4,
        "IntGain": 1.5,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.36,
        "AttackSwing": 0.64,
        "CastPoint": 0.35,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 20,
      "Name": "Tidehunter",
      "imgURL": "./img/Tidehunter_icon.png",
      "Info": "Tidehunter is a very durable hero who brings disables and debuffs to the field. He focuses on debilitating the enemy and shrugging off their attempts to disable and kill him, as he is capable of absorbing a tremendous amount of punishment.",
      "Summary":"Leviathan, the Tidehunter, is a melee strength hero who is formidable due to his uncommonly tough hide and his ocean spells that sweep enemies upward. He can be played as a support or as an offlane hero whose greatest strengths lie in being able to take heavy amounts of damage in the early game and the disabling powers of his spells. Though he does not deal especially high damage at any point in the game, his spells can have a devastating effect on the enemy without expending much mana. He is able to send forth a spray of water to slow down the enemy retreat and his outrageous ultimate, Ravage, throttles enemies in a massive area around him. The durability of his Kraken Shell allows him to shrug off damage for absurd survivability against low damage attacks. Tidehunter's ability to shrug off damage and his enormous strength gain makes him very durable, and the power of his spells means he is a tank the enemy very much needs to target.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 53,
        "MinDmg": 47,
        "HP": 598,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.1,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 15,
        "BaseInt": 16,
        "StrGain": 3,
        "AgiGain": 1.5,
        "IntGain": 1.7,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.6,
        "AttackSwing": 0.56,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 21,
      "Name": "Wraith King",
      "imgURL": "./img/Wraith_King_icon.png",
      "Info": "Wraith King is a durable carry with a reliable stun. As his ultimate, Reincarnation, effectively doubles his health in a teamfight, he is commonly built as a tank carry.",
      "Summary":"Ostarion, the Wraith King, is a melee strength hero, as well as a carry and tank, capable of both dealing and taking plenty of damage. His infamous Reincarnation allows the Wraith King to rise again after death, acting like an Aegis of the Immortal, making him especially difficult to kill. But if left alive, the Wraith King can wreak havoc upon his enemies; his Wraithfire Blast provides reliable damage and a stun on a short cooldown, Vampiric Aura grants his team sizeable lifesteal, and Mortal Strike helps make short work of foes.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 63,
        "MinDmg": 61,
        "HP": 598,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 18,
        "BaseInt": 18,
        "StrGain": 2.9,
        "AgiGain": 1.7,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.56,
        "AttackSwing": 0.44,
        "CastPoint": 0.35,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 22,
      "Name": "Lifestealer",
      "imgURL": "./img/Lifestealer_icon.png",
      "Info": "Lifestealer is a voracious flesh-eater who Feasts on his prey to regain his health, after inflicting them with deadly Open Wounds. Consumed by madness, he will go through vicious Rage that will grant him magic immunity and bonus attack speed.",
      "Summary":"N'aix, the Lifestealer, is a vicious melee Strength hero whose abilities give him the power to bring down durable heroes quickly, while sustaining his health by leeching the very life of his enemies. The main role of the Lifestealer is to fulfill the job of a formidable carry, he is able to do so by restoring his life through his abilities. Feast is his passive ability and his signature, every attack he lands consumes the flesh and blood of his victim, dealing bonus physical damage while regenerating his own health. With Feast, he can munch down strong tanks. N'aix can send himself into a bloody Rage, increasing his attack speed, while granting a short period of spell immunity. Open Wounds tears the enemy, causing the prey's wounds to open, bleeding their life essence, allowing Lifestealer and his allies to feast down as well as greatly slowing them to a crawl. Rage and Open Wounds allows Lifestealer to brutally rip his victim apart, feasting on their health in the process. When in need, N'aix can use Infest to hide himself inside his allies or any non-hero unit, laying dormant, until he is ready to come out, devouring the flesh from the inside, killing the non-hero unit, bursting out the chunks of flesh and bones of his unfortunate host, damaging foes around him and ambushing them with carnivorous savagery. The Lifestealer is a monstrous beast of gluttony and greed, bent on stealing the lives of every living creature he encounters, violently killing them to sate the Lifestealer's terrifying thirst and hunger.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 67,
        "MinDmg": 57,
        "HP": 655,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 25,
        "BaseAgi": 18,
        "BaseInt": 15,
        "StrGain": 2.4,
        "AgiGain": 1.9,
        "IntGain": 1.75,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.39,
        "AttackSwing": 0.44,
        "CastPoint": 0.01,
        "CastSwing": 0.01,
        "Turnrate": 1,
        "Legs": 2
      }
    },
    {
      "ID": 23,
      "Name": "Night Stalker",
      "imgURL": "./img/Night_Stalker_icon.png",
      "Info": "Night Stalker is a strong early game ganker during the night. Night Stalker depends greatly on darkness in order to be effective as his abilities greatly increase in strength during the night.",
      "Summary":"Balanar, the Night Stalker, is a melee strength hero, renowned for being a very potent ganker once night falls. Unlike most other heroes in the game, Night Stalker's strength greatly fluctuates depending on the time of day. He is relatively innocuous during the day, with one of his abilities being completely disabled then while two others are heavily weakened in potency, but he quickly becomes a force to be reckoned with once the moon rises. He has a mini-stun and slow in Void, which allows him to hound and nuke down lone enemies who are unfortunate enough to encounter him; the slow effect is considerably more debilitating at night. He also has the ability to silence and blind his foes with Crippling Fear, which drastically increases in duration at night, preventing spellcasters and even carries from retaliating against him while he lashes at them with relative impunity. His passive, Hunter In the Night, greatly boosts his movement speed and attack speed at night, allowing him to easily move around the map, to pursue and tear apart his prey. Finally, his ultimate, Darkness, summons instant nighttime and hampers enemy night vision, making even the strongest enemy heroes sitting ducks for the Night Stalker and his allies. A terror in darkness, Night Stalker is the embodiment of heroes' nightmares, and one of the last things they will ever wish to encounter alone at night.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 65,
        "MinDmg": 61,
        "HP": 617,
        "Mana": 208,
        "HPRegen": 2,
        "ManaRegen": 0.01,
        "Armor": 5.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 18,
        "BaseInt": 16,
        "StrGain": 2.8,
        "AgiGain": 2.25,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1200,
        "NightVision": 1800,
        "AttackPoint": 0.55,
        "AttackSwing": 0.55,
        "CastPoint": 0.3,
        "CastSwing": 0.3,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 24,
      "Name": "Doom",
      "imgURL": "./img/Doom_icon.png",
      "Info": "Doom is a versatile carry who can become a powerful late-game threat due to his ability to quickly farm with Devour, his strong nuking power, and his ultimate Doom that lets him disable an enemy for at least 16 seconds.",
      "Summary":"Lucifer, the Doom, is a melee strength hero with strong farming capabilities, good versatility, and one of the strongest single-target disables in the game. His very low starting armor makes him vulnerable to harassment, but his abilities and high health allow him to lane or even jungle quite effectively. A ruthless demon, Doom possesses malicious abilities revolving around greed, fire, and death. His Devour ability allows him to consume creeps, providing additional gold and allowing him to absorb their powers, using them to increase his own strength. Because there are numerous neutral creep abilities to choose from to supplement his other abilities, the role that he chooses to play is quite flexible. Scorched Earth serves numerous purposes, allowing him to chase, escape, regenerate, and slowly burn his enemies all at once. He can deal tremendous damage with Infernal Blade, an attack modifier which mini-stuns enemies and deals damage over time, based on their maximum health, making it a powerful nuking ability that scales into the late game. Finally, his namesake ultimate Doom serves as one of the strongest single-target lockdown abilities in the game. A unit afflicted with Doom takes intense damage over a lengthy duration while having all its active abilities - even those from items - completely silenced. With numerous expensive items in his arsenal and a key enemy hero rendered useless for a teamfight, a farmed Doom ensures that nobody can extinguish his flame.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 69,
        "MinDmg": 53,
        "HP": 674,
        "Mana": 169,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.54,
        "Range": 150,
        "ProjectileSpeed": 0,
        "BaseStr": 26,
        "BaseAgi": 11,
        "BaseInt": 13,
        "StrGain": 3.2,
        "AgiGain": 0.9,
        "IntGain": 2.1,
        "PrimaryStat": "STR",
        "BaseAttackTime": 2,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 25,
      "Name": "Spirit Breaker",
      "imgURL": "./img/Spirit_Breaker_icon.png",
      "Info": "Spirit Breaker usually serves as an initiator/ganker/tank role in the team. His skillset allows/requires player to consistently checking for any ganking opportunity across the map meanwhile helping his team secure space and farm.",
      "Summary":"Barathrum, the Spirit Breaker, is a powerful ganker-type melee strength hero that excels at focusing on and taking out lone targets in skirmishes, while lacking presence in larger team fights. His Charge of Darkness lets him charge rapidly towards any enemy visible on the map, while knocking off all enemies in his path. If you see the charge coming, it may already be too late. He is picked mostly for his high damage given by his Greater Bash which crushes the life out of his helpless victims. Barathrum can instantly and quickly move to his enemy via Nether Strike and shock them with a soul-bashing blow. Tanky, mobile and with an array of high-damage knockbacks, including a passive one attached to his right clicks, Spirit Breaker's ganking capabilities are second to none.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 70,
        "MinDmg": 60,
        "HP": 731,
        "Mana": 182,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 5.38,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 29,
        "BaseAgi": 17,
        "BaseInt": 14,
        "StrGain": 2.4,
        "AgiGain": 1.7,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.9,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.6,
        "AttackSwing": 0.3,
        "CastPoint": 0.47,
        "CastSwing": 0.8,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 26,
      "Name": "Lycan",
      "imgURL": "./img/Lycan_icon.png",
      "Info": "Lycan is a remarkable pusher who can wear down buildings and force enemies to react quickly to his regular tower onslaughts; as towers melt incredibly fast under Lycan's and his units' pressure, boosted by their canine Feral Impulse.",
      "Summary":"Banehallow, the Lycan, is a melee strength hero who is capable of immense physical damage and considerable movement speed, who also excels at pushing buildings and bolstering his team's damage and health. He is capable of summoning Wolves who make excellent sources of damage and objective control. His Howl gives a large boost to the attack damage and health of his allies, while Feral Impulse turns Lycan and his pack into prime fighters on their own with bonus attack damage and health regeneration. When the time is right, Shapeshift allows the Lycan himself to join in the hunt, overwhelming foes with deadly critical strikes and incredible movement speed.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 62,
        "MinDmg": 58,
        "HP": 598,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.24,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 16,
        "BaseInt": 17,
        "StrGain": 3,
        "AgiGain": 1.9,
        "IntGain": 1.55,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.55,
        "AttackSwing": 0.55,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 27,
      "Name": "Chaos Knight",
      "imgURL": "./img/Chaos_Knight_icon.png",
      "Info": "Chaos Knight is a powerful strength hero dealing high physical damage that smashes his foes with straight, but powerful hits due to his Chaos Strike. Chaos Bolt is a luck-base spell that makes it hard to use, and he can close the gap with his enemies through Reality Rift.",
      "Summary":"Chaos Knight is a melee strength hero with one of the highest physical damage output ceilings of all heroes. He is mostly played as a carry and ganker. As his name implies, he has a theme based on randomness and uncertainty. His regular attack has an incredibly wide thirty damage spread, making his last hitting ability somewhat unreliable. Chaos Bolt is his most notorious luck-based ability which, at max level, can stun a target anywhere between a mediocre 2 seconds to an effective 4 seconds that will almost certainly assure the target's death; it will also deal a variable amount of damage ranging from minuscule to moderate. Reality Rift pulls Chaos Knight and his target to a randomly chosen point along the line between the two and reduces the foe's armor. Chaos Strike is a crit-based ability with one of the lowest proc chances, yet also one of the highest multipliers. The illusions produced by his ultimate Phantasm, up to four at max level, retain his full attack damage, benefit from his Chaos Strike and can teleport alongside him to attack the target whenever he uses Reality Rift. This allows Chaos Knight's physical damage output to be multiplied by up to five during teamfights later in the game, and it is not uncommon to see enemy heroes being killed instantly after being Reality Rifted by the apocalyptic horsemen. Thus, Chaos Knight is played as a carry who excels in both the mid and late game, if the game drags on long enough and he is able to acquire enough strength-based and survivability items to ensure that his illusions can stay alive, he will be able to overpower most hard carries and potentially wipe out an entire team by himself.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 325,
        "MaxDmg": 79,
        "MinDmg": 49,
        "HP": 560,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.96,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 20,
        "BaseAgi": 14,
        "BaseInt": 16,
        "StrGain": 2.9,
        "AgiGain": 2.1,
        "IntGain": 1.2,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.4,
        "CastSwing": 0.2,
        "Turnrate": 0.5,
        "Legs": 6
      }
    },
    {
      "ID": 28,
      "Name": "Undying",
      "imgURL": "./img/Undying_icon.png",
      "Info": "Undying usually serves as a lane support/tank role in the team. His skillset allows player to harass enemy off the lane meanwhile helping his carry to secure space to farm.",
      "Summary":"Undying, the Almighty Dirge, is a melee strength hero who serves as a formidable tank and a dangerous spellcaster. His abilities force opponents to either kill him or suffer powerful debuffs in a teamfight. Decay is a spammable ability that steals enemies' Strength in an area, making them more fragile and Undying himself more durable as the fight goes on while also being exceptionally potent during the early laning phase, leaving your opponents with mere scraps of health. Soul Rip can act as both a powerful heal or nuke, redirecting the flow of living energy to a target. By ripping some of the health of his ally or enemy in an area, the target can be healed if an ally, or damaged if an enemy. This is empowered by Tombstone, which acts as a static tank by summoning zombies to slow Undying's foes while active. With the zombies summoned, Soul Rip can perform to its fullest, while Decay weakens Undying's foes. Finally, Undying can transform into a horrific Flesh Golem. This transformation increases all allied damage by a significant percentage, and helps keep him alive as his team kills the enemy. Monstrous and truly horrifying, Undying finds great pleasure in keeping himself alive and vital, while his adversaries suffer as he delivers death to the field. With powerful abilities that allow him to perform well in large fights, the Dirge may never cease.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 310,
        "MaxDmg": 65,
        "MinDmg": 57,
        "HP": 598,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.4,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 10,
        "BaseInt": 27,
        "StrGain": 2.1,
        "AgiGain": 0.8,
        "IntGain": 2.5,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.45,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 29,
      "Name": "Magnus",
      "imgURL": "./img/Magnus_icon.png",
      "Info": "Magnus is one of the few melee heroes who can solo the middle lane well, because of his skill set. Shockwave allows him to safely get last hits while also harassing the lane opponent.",
      "Summary":"Magnus the Magnoceros is a monstrous melee strength hero who is usually played as a ganker, initiator, or semi-carry. His ability to battle multiple heroes at once gives him an excellent presence in team fights. In addition to his teamfight presence, he can buff allies or himself with bonus damage and cleave, capitalizing on his ability to group up multiple enemies. As a hero who possesses multiple area-of-effect abilities with a manageable mana cost, and a very powerful ultimate that serves as a great team fight initiation ability, Magnus is truly a force to be reckoned with.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 61,
        "MinDmg": 49,
        "HP": 579,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.1,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 15,
        "BaseInt": 19,
        "StrGain": 2.75,
        "AgiGain": 2.5,
        "IntGain": 1.65,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.84,
        "CastPoint": 0.3,
        "CastSwing": 0.6,
        "Turnrate": 0.8,
        "Legs": 4
      }
    },
    {
      "ID": 30,
      "Name": "Anti-Mage",
      "imgURL": "./img/Anti_Mage_icon.png",
      "Info": "Anti-Mage is one of the most mobile carries in the game, mostly well known for his ability to punish lineups heavily reliant on magic damage with Spell Shield giving him very high magic resistance.",
      "Summary":"Anti-Mage is a fast melee agility carry with an emphasis on disrupting and killing high-mana enemies. He has notably high agility and low base attack time, giving him high damage and scaling with his basic attacks. His signature ability is Mana Break, a passive attack modifier that makes him a huge threat to mana-reliant heroes, mainly Intelligence-based casters. In addition to granting substantial bonus damage on each attack, its mana burn sets enemies up to be devastated by his ultimate ability, Mana Void. Blink is a highly versatile ability that allows Anti-Mage to instantly teleport short distances, thereby allowing him to escape, chase, and even farm with ease. Combined with his high base movement speed, this makes Anti-Mage a highly mobile hero at all points in the game. Spell Shield greatly increases Anti-Mage's magic resistance, allowing him to sustain more damage from enemy casters. Finally, Mana Void finishes off targets after their mana has been burned, inflicting heavy damage to both the target and enemies surrounding the target. The damage Mana Void can potentially deal scales extremely well into the late game, as enemies' mana pools only grow larger over time. His naturally fast basic attacks combined with his powerful abilities make him extremely dangerous in the late game, allowing him to devastate enemies with ease if he is allowed to farm as a hard carry.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 53,
        "MinDmg": 49,
        "HP": 560,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.08,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 22,
        "BaseInt": 15,
        "StrGain": 1.2,
        "AgiGain": 2.8,
        "IntGain": 1.8,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.45,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.6,
        "CastPoint": 0.3,
        "CastSwing": 0.47,
        "Turnrate": 0.5,
        "Legs": 1
      }
    },
    {
      "ID": 31,
      "Name": "Drow Ranger",
      "imgURL": "./img/Drow_Ranger_icon.png",
      "Info": "Drow Ranger is a deadly archer, chilling and killing her enemies with volleys of Frost Arrows. With one of the highest agility stats in the game, her powerful shots will tear through most enemies from a safe distance.",
      "Summary":"Traxex, the Drow Ranger, is a ranged agility hero whose greatest assets are her incredible damage and ability to keep threats at bay. Traxex is a carry who, though lacking survivability, provides a worthwhile contribution through her damage alone. The Drow Ranger can be extremely powerful at any point in the game. As an agility hero, Traxex's damage is based largely on her basic attacks and is among the greatest largely due to the massive amounts of agility she gains from her passive ultimate, Marksmanship. The Drow Ranger also adds ranged damage to teammates with her global Precision Aura. Despite her lack of escape spells, Drow Ranger can keep herself relatively safe from enemy spellcasters and melee heroes using her Gust and her Frost Arrows, respectively. Frost Arrows infuses her attacks with ice, greatly slowing down her enemies. Since it can be manually cast, Frost Arrows can be used to harass her foes in the early game without drawing the creeps' attention. Gust is a great counter to enemy spellcasters as well as melee heroes as Gust pushes heroes away from Drow and prevents them from casting spells, who might threaten her life in battles. Position is of utmost importance as Traxex is quite vulnerable in close combat and the agility bonus from Marksmanship is removed when enemies come near her. This means she struggles against melee heroes with high mobility.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 55,
        "MinDmg": 44,
        "HP": 503,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.64,
        "Range": 625,
        "ProjectileSpeed": 1250,
        "BaseStr": 17,
        "BaseAgi": 26,
        "BaseInt": 15,
        "StrGain": 1.9,
        "AgiGain": 1.9,
        "IntGain": 1.4,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.7,
        "AttackSwing": 0.3,
        "CastPoint": 0.4,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 32,
      "Name": "Juggernaut",
      "imgURL": "./img/Juggernaut_icon.png",
      "Info": "Juggernaut is a formidable swordsman capable of engaging and cutting down single enemies without much risk to himself. A medium carry, Juggernaut can support his teammates with Healing Ward, and escape dangerous situations with Blade Fury.",
      "Summary":"Yurnero the Juggernaut is a melee agility hero whose abilities allow him to sprint into battle and recklessly devastate enemies in an impenetrable flurry of blades. His abilities grant invulnerability and spell immunity, turning him into an unstoppable force on a hairpin. Juggernaut is strong both offensively and defensively, and deals heavy damage both physical and magical with his Blade Fury and Omnislash ultimate, but he possesses below average strength and intelligence attributes, so he does not have as much health and mana as other heroes and is vulnerable when his abilities are on cooldown. For this reason, although his abilities make him powerful even in the early game, he cannot charge into forces without restraint until farmed and is usually played as a carry.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 48,
        "MinDmg": 44,
        "HP": 560,
        "Mana": 182,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 2.8,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 20,
        "BaseAgi": 26,
        "BaseInt": 14,
        "StrGain": 1.9,
        "AgiGain": 2.4,
        "IntGain": 1.4,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.4,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.33,
        "AttackSwing": 0.84,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 33,
      "Name": "Mirana",
      "imgURL": "./img/Mirana_icon.png",
      "Info": "Mirana is a very well-rounded hero who can fill almost any role required by her team. Her array of spells gives her the ability to disable, nuke, push, escape and gank in any number of situations.",
      "Summary":"Mirana, the Princess of the Moon, is a ranged agility hero that uses her abilities to surprise, chase, and assault enemies. She is an excellent huntress and widely known for her Sacred Arrow which stuns her victim with deadly precision. The arrow stuns longer when it's fired from a farther distance. Mirana can bring down the stars with Starstorm to damage nearby enemies and an additional star to cast down on her one unfortunate target. Mounting with her trusted tiger Sagan, Mirana can Leap forward over a distance, to escape or chase, and enhance her with a roar, increasing her attack and movement speed. Invoking the power of her moon goddess, Mirana uses her ultimate, Moonlight Shadow to cloak all allied heroes and herself with invisibility. At any time, Mirana and her allies can break out of their hiding with an ambush and fade into the shadows again during the duration of the spell. With an array of mighty and supportive abilities, Mirana is a versatile heroine that can excel early in the game as a mobile ganker. She is not very heavily reliant on luxury items but she can benefit from almost any item that gives her presence in the battlefield.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 49,
        "MinDmg": 38,
        "HP": 503,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 630,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 20,
        "BaseInt": 17,
        "StrGain": 1.85,
        "AgiGain": 3.3,
        "IntGain": 1.65,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.5,
        "CastSwing": 0.83,
        "Turnrate": 0.4,
        "Legs": 6
      }
    },
    {
      "ID": 34,
      "Name": "Morphling",
      "imgURL": "./img/Morphling_icon.png",
      "Info": "Morphling is a carry hero who switches between damage dealer and resilient survivor. With an Ethereal Blade, Morphling can deal extremely high burst damage, often taking out an enemy instantly.",
      "Summary":"Morphling is a ranged agility hero that has many flexible abilities, item builds and is leveled as a very strong hard carry. He relies strongly on his attributes, and is an effective ganker. Unlike other agility carries that rely on physical attacks, he relies on his powerful abilities to initiate and shift into a state from which he can make a kill. Waveform lets him surge directly forward to a location, damaging enemies on his path, working both as a nuke or an escape. Adaptive Strike is an interesting scaling two-part ability that blasts enemies with magical water, either stunning and knocking back or dealing damage. Its power is based on either agility or strength. Attribute Shift allows him to edit his physical being, switching it from Agility or Strength, transforming him into a strong damage dealer or a tank. His ultimate, Morph, transforms him into a copy of an enemy using their stats and basic abilities.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 285,
        "MaxDmg": 46,
        "MinDmg": 37,
        "HP": 541,
        "Mana": 221,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.66,
        "Range": 350,
        "ProjectileSpeed": 1300,
        "BaseStr": 19,
        "BaseAgi": 24,
        "BaseInt": 17,
        "StrGain": 2,
        "AgiGain": 3.4,
        "IntGain": 1.5,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.6,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.25,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 0
      }
    },
    {
      "ID": 35,
      "Name": "Phantom Lancer",
      "imgURL": "./img/Phantom_Lancer_icon.png",
      "Info": "Phantom Lancer is an exceptional carry who outnumbers and overwhelms his targets with armies of illusions. With the ability to charge at his opponents, the Phantom Lancer is relatively mobile, and can disappear briefly from the battlefield to confuse or avoid his enemies.",
      "Summary":"Azwraith, the Phantom Lancer, is a melee agility carry and pusher because of his ability to generate an army of illusions in a matter of seconds. He requires deep cunning, positioning, and most importantly, great micromanagement as his illusions might just get in the way rather than help the situation if not utilized correctly. Many of his abilities help him in his creation of images, allowing him to always have a companion. He has a nuke ability in Spirit Lance, which deals moderate damage, slows the target, and creates an illusion at his target's location. His escape ability Doppelganger allows him to quickly relocate himself and any nearby illusions while creating additional ones, possibly tricking enemies into wasting their spells and time in trying to kill said illusions. His passive Phantom Rush allows him and his illusions to close the distance toward a target when issued an attack order, giving him the ability to quickly focus single targets in battle. His ultimate Juxtapose gives him the ability to generate a large number of illusions when attacking a target, while giving said illusions the ability to replicate themselves as well. Phantom Lancer is an extremely mobile hero who is hard to pin down and can quickly overwhelm his opponents in battle.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 67,
        "MinDmg": 45,
        "HP": 522,
        "Mana": 273,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 3.22,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 18,
        "BaseAgi": 29,
        "BaseInt": 18,
        "StrGain": 1.7,
        "AgiGain": 2.6,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 36,
      "Name": "Vengeful Spirit",
      "imgURL": "./img/Vengeful_Spirit_icon.png",
      "Info": "Vengeful Spirit is a very strong and well-balanced support who specializes in roaming, ganking, and disabling. Unlike most other casting supports, her skill set emphasizes physical damage over magical, allowing her abilities to be useful in the late game.",
      "Summary":"Shendelzare, the Vengeful Spirit, is a ranged agility hero who excels at ganking, disabling, and kill hunts. She is one of the most well-rounded supports in the game, possessing a skill set that allows her to set up kills for her team during ganks and teamfights, strengthening her team and weakening the enemy in large-scale engagements, and saving allies from certain death if they are caught by the enemy. Effective at all stages of the game, Vengeful Spirit is typically seen roaming the battlefield, searching for targets to prey on. She possesses a strong targeted stun in Magic Missile and an armor reduction debuff in Wave of Terror, making her a strong partner in a gank. Motivated by her lust for revenge, Vengeance Aura boosts the attack damage of all nearby allies, making Shendel an invaluable ally to teams with strong physical damage output and turning her into a potential semi-carry. If Shendelzare's allies die under the aura, their death will not be in vain as their spirits will continue the fight for a few seconds. Her ultimate Nether Swap immediately swaps Vengeful Spirit's position with another hero, ally or enemy, allowing her to displace a key enemy hero for easy elimination, or save an ally in distress at the potential cost of her own life. Vengeful Spirit's skill set and low reliance on farm allows her to be played with great recklessness, as even her death can be integral towards guiding her team to victory. Shendelzare requires very selfless and skilled play to operate well, and relies on the competence of teammates as much as herself.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 53,
        "MinDmg": 39,
        "HP": 484,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.78,
        "Range": 400,
        "ProjectileSpeed": 1500,
        "BaseStr": 18,
        "BaseAgi": 27,
        "BaseInt": 15,
        "StrGain": 2.6,
        "AgiGain": 3.3,
        "IntGain": 1.75,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.33,
        "AttackSwing": 0.64,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 37,
      "Name": "Riki",
      "imgURL": "./img/Riki_icon.png",
      "Info": "Riki's permanent invisibility is both his greatest strength and his greatest weakness. On one hand, it makes him able to surprise enemies and farm with very little concern. On the other hand, without invisibility he has no real defense.",
      "Summary":"Riki, the Stealth Assassin, is a melee agility hero that uses stealth in order to surprise enemies and quickly kill them. His trademark ability, Cloak and Dagger, lets him sneak up on his enemies from behind and deal massive backstab damage, and then quickly escape. This enables him to close in on the enemy and drop his devastating Smoke Screen, which cripples fighters and spellcasters alike. Blink Strike allows Riki to chase with impunity, while Tricks of the Trade makes quick work of his enemies during teamfights.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 42,
        "MinDmg": 38,
        "HP": 503,
        "Mana": 182,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.76,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 17,
        "BaseAgi": 34,
        "BaseInt": 14,
        "StrGain": 1.6,
        "AgiGain": 2.2,
        "IntGain": 1.3,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.4,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 38,
      "Name": "Sniper",
      "imgURL": "./img/Sniper_icon.png",
      "Info": "Sniper is a very long ranged carry, designed to decimate enemies from the backline. He is able to scout ahead with his Shrapnel, and pick off targets from extreme distances with Assassinate.",
      "Summary":"Kardel Sharpeye, the Sniper, is a ranged agility carry who excels at dealing moderate to heavy damage from an incredible range. With no escape mechanism, poor mobility, and only a modest health pool, Sniper is exceptionally frail at all stages of the game and vulnerable to enemies who confront him head-on. However, his abilities provide him both the means to keep his distance and systematically destroy his enemies from afar. Shrapnel is a potent, high-cast range zoning ability that provides vision for Sniper while slowing and damaging enemies in its area of effect; with up to 3 charges on the ability, Sniper can completely close off any viable routes for his opponents to approach or escape. Headshot supplements Sniper's right-click damage and briefly stops enemies when it procs, which can be quite debilitating since it has a high rate of occurring. His third ability, Take Aim, gives him the largest attack range of any hero in the game, allowing him to deal high DPS from a safe distance while also giving him the ease to switch between targets at a moment's notice. Finally, Assassinate is a strong finishing and harassing ability, dealing hefty damage to an enemy from an enormous distance after a brief aiming period. Sniper is heavily item-dependent, relying on means to increase his survivability as well as his damage output as the game progresses. Skilled players will find that positioning is the most important thing to keep in mind when playing him or against him.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 42,
        "MinDmg": 36,
        "HP": 484,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.94,
        "Range": 550,
        "ProjectileSpeed": 3000,
        "BaseStr": 16,
        "BaseAgi": 21,
        "BaseInt": 15,
        "StrGain": 1.7,
        "AgiGain": 2.5,
        "IntGain": 2.6,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 1000,
        "AttackPoint": 0.17,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 39,
      "Name": "Templar Assassin",
      "imgURL": "./img/Templar_Assassin_icon.png",
      "Info": "Templar Assassin is a highly elusive and devastating hero in the right hands. Her Refraction simultaneously protects her from any damage instance, no matter how low or high, and increases her attack damage output for a few attacks.",
      "Summary":"Lanaya the Templar Assassin is a very short-ranged Agility hero capable of dealing huge bursts of Physical damage to swathes of enemies with expert positioning and timing. Unlike most physical damage dealers, Lanaya reaches her damage potential quite early and then scales up from that point with carry items, letting her gank with impunity throughout the mid-game, and her short attack range increases from being comparable to that of a melee hero to a ranged hero with short reach as she levels Psi Blades. Her Psionic Traps provide map control and the ability to chase down fleeing heroes from up to 2000 range, and Refraction and Meld lets you shrug off high-damage nukes and disjoint projectiles. With a Blink Dagger, Lanaya can quickly materialize in the enemy team's weakest flank and shred several heroes at once with her Meld and Psi Blades.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 59,
        "MinDmg": 53,
        "HP": 522,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.22,
        "Range": 140,
        "ProjectileSpeed": 900,
        "BaseStr": 18,
        "BaseAgi": 23,
        "BaseInt": 20,
        "StrGain": 2.1,
        "AgiGain": 2.7,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.7,
        "Legs": 2
      }
    },
    {
      "ID": 40,
      "Name": "Luna",
      "imgURL": "./img/Luna_icon.png",
      "Info": " Luna is a highly offensive carry who can demolish buildings and clear the battlefield in very little time. Along with her flying Moon Glaivess, Luna can call upon the goddess Selemene to cover the battlefield in an Eclipse.",
      "Summary":"Luna the Moon Rider is a ranged agility carry hero. Even though she can be seen as a tempting target for enemy heroes, Luna possesses solid early game laning presence due to her Lucent Beams, a cheap, low-cooldown nuke, and her Lunar Blessing aura, which grants all nearby allied heroes increased damage. Mid-game, she becomes far more formidable with Moon Glaives, allowing her to kill entire creep waves with two to three attacks, and Eclipse, which can very quickly kill a hero if that hero is unfortunate enough to catch its full blast. Her Achilles' Heel is her fragility; she has no escape abilities and cannot handle a lot of punishment, relying on her movement speed to keep her out of harm's way. Luna begins and ends a match dangerously, and if played carefully and skillfully, she will destroy anybody who stands against her.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 330,
        "MaxDmg": 54,
        "MinDmg": 48,
        "HP": 465,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.08,
        "Range": 330,
        "ProjectileSpeed": 900,
        "BaseStr": 15,
        "BaseAgi": 18,
        "BaseInt": 16,
        "StrGain": 2.2,
        "AgiGain": 2.8,
        "IntGain": 1.85,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.54,
        "CastPoint": 0.6,
        "CastSwing": 0.4,
        "Turnrate": 0.6,
        "Legs": 6
      }
    },
    {
      "ID": 41,
      "Name": "Bounty Hunter",
      "imgURL": "./img/Bounty_Hunter_icon.png",
      "Info": "Bounty Hunter is a strong utility support hero who helps his team by picking off the enemy one by one, increasing gold gain for his team and giving them opportunities to take map objectives while they outnumber the enemy.",
      "Summary":"Gondar the Bounty Hunter is a melee agility Hero that excels at hunting, chasing down and killing single targets. His skill set allows him to roam and gank very effectively, as his Shadow Walk allows him to sneak up to unsuspecting targets to initiate. Shadow Walk is also an effective escape and mobility spell, as he can run from dangerous situations and roam invisibly around the map to keep the enemy guessing even if they have Observer Wards active. His ability to deal medium amounts of damage with Jinada, interrupt their Town Portal Scrolls with Shuriken Toss, and keep perfect tabs on their location and movements with Track all make him a powerful and ruthless ganker who is all but impossible to escape once he has his sights locked in. Bounty Hunter's ability to roam, scout and get important kills for his team while bolstering their gold gain with Track can secure his team a strong gold advantage, and give his foes no safe place to hide.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 59,
        "MinDmg": 45,
        "HP": 503,
        "Mana": 247,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 5.94,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 17,
        "BaseAgi": 21,
        "BaseInt": 19,
        "StrGain": 1.8,
        "AgiGain": 3,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 1000,
        "AttackPoint": 0.6,
        "AttackSwing": 0.59,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 42,
      "Name": "Ursa",
      "imgURL": "./img/Ursa_icon.png",
      "Info": "Ursa is a simple carry/anti-tank hero who specialises in quickly taking out enemies one at a time. He is powerful from start to finish, tearing apart enemies and getting early Roshan kills for his team with the help of his passive Fury Swipes.",
      "Summary":"Ulfsaar, the Ursa Warrior (or simply Ursa), is a melee agility hero whose abilities' main focus is the increase of attack damage, allowing for some of the most impressive sustained damage in the entire game. He specializes in increasing damage against one target. His abilities allow him to attack with almost maximum speed and gain bonus damage with each consecutive hit on a single target. With the abilities Overpower and Fury Swipes, Ursa can often savage beefy targets for as much as 700 damage per hit. He is a ferocious jungler and straightforward attacker, able to solo even Roshan at low levels if he has lifesteal. Ursa is a carry who can snowball if he is farmed, but the array of anti-melee abilities existing even by the early game and his lack of any counterspells may cripple his potential, especially as strong nukers and heroes with the ability to evade him make him a hero reliant on spellcasters on his team. Although an agility hero, Ursa's base strength and strength gain make him very durable.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 310,
        "MaxDmg": 49,
        "MinDmg": 45,
        "HP": 617,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 5.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 18,
        "BaseInt": 16,
        "StrGain": 2.7,
        "AgiGain": 2.1,
        "IntGain": 1.5,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.3,
        "CastSwing": 0,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 43,
      "Name": "Gyrocopter",
      "imgURL": "./img/Gyrocopter_icon.png",
      "Info": "Gyrocopter is a ranged carry who specializes at dishing out physical and magical damage over a wide area. He presents an unorthodox pattern of carry in that he can deal a large amount of magical damage and crowd control much earlier than other carry heroes thanks to Call Down and Rocket Barrage.",
      "Summary":"Aurel, the Gyrocopter, is a ranged agility hero, capable of outputting a lot of single target and area of effect damage at a multitude of ranges. Early game Gyrocopter is a strong ganker, with Rocket Barrage able to output a lot of damage in a short amount of time if he and his target are alone. His second ability, Homing Missile, is a long range projectile that forces opponents to either stop and engage to take out the missile, or run to a safe location before being stunned. Thanks to his third ability, Flak Cannon, he is also an excellent pusher, and with it can farm up big items in the midgame as his spells start to fall off in damage. Flak Cannon also allows him to hit everyone in a teamfight with his autoattack, and with enough damage items he can inflict a lot of damage to the entire enemy team. Call Down is a useful ultimate with a low cooldown, providing a large area slow and nuke making it great for team fights. With the right items, he can also transition into a carry role.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 51,
        "MinDmg": 41,
        "HP": 522,
        "Mana": 299,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.36,
        "Range": 365,
        "ProjectileSpeed": 3000,
        "BaseStr": 18,
        "BaseAgi": 24,
        "BaseInt": 19,
        "StrGain": 1.8,
        "AgiGain": 2.8,
        "IntGain": 2.1,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.2,
        "AttackSwing": 0.97,
        "CastPoint": 0.3,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 0
      }
    },
    {
      "ID": 44,
      "Name": "Lone Druid",
      "imgURL": "./img/Lone_Druid_icon.png",
      "Info": "Lone Druid is an adaptive carry who controls a durable Lone Druid Spirit Bear to wreak havoc on the battlefield. With two separate item inventories, the pair acts like two complimentary heroes with variety playstyles, either Lone Druid providing buffs from the back while the Spirit Bear fights on the front lines",
      "Summary":"Sylla, the Lone Druid, is an adaptable and versatile ranged or melee agility hero, who summons a Spirit Bear, which has its own set of abilities and can equip items, as his ally. With the help of his Spirit Bear, he can carry, jungle, and push lanes effectively. Because of this, technically speaking, the Spirit Bear and Lone Druid himself are two available heroes at once. The Lone Druid himself is mostly played as the aura giver, while the Spirit Bear is played as the main damage dealer and tank. When he activates his abilities, it will not only buff him but the Spirit Bear as well. Lone Druid is versatile as he can change from a fast ranged warrior to a tough and mighty melee bear himself. Together, they can push lanes and towers quickly, farm neutrals in a clinch, and even take down Roshan by themselves if equipped with the right items. Due to the Spirit Bear not benefiting from attributes, it scales weakly into the later portions of the game, encouraging a midgame-oriented playstyle. However, should the need arise, its six extra usable item slots make Lone Druid a force to be reckoned with far into the lategame.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 325,
        "MaxDmg": 50,
        "MinDmg": 46,
        "HP": 503,
        "Mana": 169,
        "HPRegen": 0.5,
        "ManaRegen": 0.01,
        "Armor": 3.36,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 24,
        "BaseInt": 13,
        "StrGain": 2.1,
        "AgiGain": 2.7,
        "IntGain": 1.4,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.33,
        "AttackSwing": 0.53,
        "CastPoint": 0.5,
        "CastSwing": 1.17,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 45,
      "Name": "Naga Siren",
      "imgURL": "./img/Naga_Siren_icon.png",
      "Info": "Naga Siren is a versatile hero who can appear to be a team's hard carry while actually being just a support. As a support, you can pin down an enemy with Ensnare icon.png Ensnare that pierces spell immunity, reduce armor with Rip Tide.",
      "Summary":"Slithice, the Naga Siren, is a melee agility hero who can be played both as a late-game carry and an early/mid-game support. Slithice is an item dependent hero yet with the right style and inventory choices she can overpower many other heroes that deal strong physical damage while casting her four active abilities to handle her enemies altogether and turn the tides. Mirror Image creates three illusions to wreak havoc upon her enemies. Ensnare is a very useful spell with several unique features. It not only holds an enemy in place, but also prevents them from blinking and going invisible. Even if the enemy is spell immune, Ensnare can still target the enemy unit. Rip Tide calls the forces of the seas, allowing the Siren and her illusions to unleash a wave of magical water to wash away foes and degrade their armor. The Song of the Siren is the ultimate ability for team battles; Naga Siren performs a mystical song to put her enemies to sleep in an area around her. Song of the Siren is her tool for initiation, as while her enemies are under her slumber her allies can come forth and prepare to unleash their attacks after the song wears off. Time is Naga's best friend, for as the game wears on, Slithice will gradually consume more and more of the map and engulf enemy towers and heroes like the rising tide itself.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 320,
        "MaxDmg": 46,
        "MinDmg": 44,
        "HP": 579,
        "Mana": 234,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 5.94,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 21,
        "BaseInt": 21,
        "StrGain": 2.3,
        "AgiGain": 2.75,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.65,
        "CastSwing": 0.7,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 46,
      "Name": "Bloodseeker",
      "imgURL": "./img/Bloodseeker_icon.png",
      "Info": "Bloodseeker is a snowballing carry who grows faster and stronger as his enemies get weaker. Like a shark in water, Bloodseeker detects injured enemies across the entire map and runs them down with unnatural speed through Thirst.",
      "Summary":"Strygwyr, the Bloodseeker, is a melee agility hero imbued with dreadful powers to fuel violence and rip enemies apart in the heat of close combat. He can drive targets into a maddened Bloodrage, increasing the damage of their attacks, and allowing them to heal their wounds by killing their enemies. He can also cast Bloodrage on himself turning him into a nuker. His speed is unmatched when he senses the blood of the dying, and from this perception none can escape his Thirst. By using Blood Rite, he can create a ritual field where his foes will be silenced and damaged in the process. His ultimate, Rupture, sunders the skin of his victims, causing them to trail their life force behind if they dare to flee.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 59,
        "MinDmg": 53,
        "HP": 617,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.36,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 24,
        "BaseInt": 18,
        "StrGain": 2,
        "AgiGain": 3,
        "IntGain": 1.7,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.43,
        "AttackSwing": 0.74,
        "CastPoint": 0.4,
        "CastSwing": 1.4,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 47,
      "Name": "Shadow Fiend",
      "imgURL": "./img/Shadow_Fiend_icon.png",
      "Info": "Shadow Fiend is a ranged carry who collects the soul of every unit he kills, growing stronger with each soul claimed. Because of this, he benefits from a high attack damage potential, but also suffer punishing setbacks if he dies.",
      "Summary":"Nevermore, the Shadow Fiend, is a ranged agility hero possessing abilities that inflict superb burst damage from varying distances. Whether near or far, Shadow Fiend is able to release incredible offensive power, both physical and magical. Shadow Fiend's true power comes from the souls he takes, making him more dangerous every time he kills. With enough souls, he can release all of the captured souls in a devastating burst, dealing more damage to enemies that are closer to him. Shadow Fiend is a carry who is powerful at all stages of the game, a trait most carries don't share. He can harass and conquer the early game, gank unsuspecting heroes during the mid-stages of the game, and has huge right-click potential in the late game thanks to his passives, although his active abilities scale off by the end-game.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 41,
        "MinDmg": 35,
        "HP": 465,
        "Mana": 234,
        "HPRegen": 0.5,
        "ManaRegen": 0.01,
        "Armor": 0.8,
        "Range": 500,
        "ProjectileSpeed": 1200,
        "BaseStr": 15,
        "BaseAgi": 20,
        "BaseInt": 18,
        "StrGain": 2,
        "AgiGain": 2.9,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.54,
        "CastPoint": 0.67,
        "CastSwing": 0.4,
        "Turnrate": 1,
        "Legs": 0
      }
    },
    {
      "ID": 48,
      "Name": "Razor",
      "imgURL": "./img/Razor_icon.png",
      "Info": "Razor is a fast, tough anti-carry who steals the attack power from his enemies, and transfers it to himself. He can quickly melt away armor with Eye of the Storm, allowing his team to finish off enemies with ease.",
      "Summary":"Razor, the Lightning Revenant, is a ranged position-based agility tank/carry that employs his abilities to deal massive damage in a relatively short amount of time, chase down the fleeing injured with his speed, and inflict debuffs on more powerful foes. Razor prefers to keep his position or kite his enemies allowing his spells to unleash its full potential. Known for being a great Anti-carry hero, Razor specializes in using his opponent's own powers against them, draining them of their damage and using it to smite them, as well as damaging, slowing, and purging them of buffs should they dare cast a spell on him. His ultimate, Eye of the Storm, further enhances his carry-killing powers by inflicting constant, armor-shattering, lightning strikes on the foe with the lowest HP within a 500 radius. For those who rely on their pure brute force alone to fight, there is truly no escape from the Underscape.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 47,
        "MinDmg": 45,
        "HP": 579,
        "Mana": 247,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.08,
        "Range": 475,
        "ProjectileSpeed": 2000,
        "BaseStr": 21,
        "BaseAgi": 22,
        "BaseInt": 19,
        "StrGain": 2.3,
        "AgiGain": 2,
        "IntGain": 1.8,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.5,
        "CastSwing": 0.125,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 49,
      "Name": "Venomancer",
      "imgURL": "./img/Venomancer_icon.png",
      "Info": "Venomancer is a support hero who can deal tremendous damage over time with his spells. He also possesses strong push and counter-push potential in his Plague Wards, allowing him to defend towers and high-ground as well as take enemy towers by himself.",
      "Summary":"Lesale Deathbringer the Venomancer is a ranged agility hero who is focused on dealing damage over time and slowing enemies down. While unassuming due to his mediocre stats and low attack range, he can inflict surprising amounts of gradual damage with his poisonous abilities if left alone. Venomancer can unleash a Venomous Gale to infect enemies in a straight line, drastically slowing them while dealing damage over time. His attacks are just as hazardous thanks to his lethal Poison Sting, which adds a toxic effect to his normal attacks, poisoning opposing Heroes for a great amount of damage over a duration. Plague Ward lets him summon a sentient ward to a targeted point, which attacks enemies or structures. While weak on first use its power grows in numbers, which means the more the wards are placed the deadlier they become. This gives him good versatility, providing vision, pushing power, and a helpful block, preventing enemies from running away when trapped in a sticky situation. Venomancer's most dangerous ability is Poison Nova: though it is not lethal and does not kill an enemy by itself, the damage it inflicts is tremendous, the duration is very long, and its wide area of effect makes it difficult to avoid. It is mostly used to initiate battles, since Poison Nova cannot quickly inflict damage but rather degrades its targets over time. When combined together, the Venomancer is a powerful killing machine, like a virus, slowly killing enemies with venom and poisons. Despite being considered by most players as a support, because of his slowing capabilities, extra ward vision, and being item independent, this does not hinder his power to gank and kill enemies, especially in the earliest parts of the game, and with enough kills, farm, and domination, Venomancer can transition into a semi-carry, with formidable venomous power and deadly specialties.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 285,
        "MaxDmg": 43,
        "MinDmg": 41,
        "HP": 522,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.08,
        "Range": 450,
        "ProjectileSpeed": 900,
        "BaseStr": 18,
        "BaseAgi": 22,
        "BaseInt": 18,
        "StrGain": 1.95,
        "AgiGain": 2.6,
        "IntGain": 1.75,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 50,
      "Name": "Faceless Void",
      "imgURL": "./img/Faceless_Void_icon.png",
      "Info": "Faceless Void is a hero who holds mastery over time. He dashes through the battlefield, rewinding damage with Time Walk, stuns enemies with Time Lock icon.png Time Lock, and causes their abilities to recharge slower with Time Dilation.",
      "Summary":"Darkterror the Faceless Void is a melee agility hero generally played as an off-laner or carry. Given a little time, he becomes a terrifyingly powerful hero capable of destroying entire enemy teams in seconds. Wielding his cosmically powered mace, each hit can lock his foes in time, stopping them in place. He can jump into or out of combat using Time Walk while simultaneously reverting recently taken damage. Darkterror can also pause his foes' cooldowns with Time Dilation, lowering their attack and movement speed in the process. His ultimate, Chronosphere, locks time for everything within its area of effect, giving him time to strike down any enemies caught within with no resistance from them for several seconds. Though ideally he wants teammates who can capitalize on Chronosphere, it's one of the most devastating initiation spells in the game and can easily win team fights before his opponents can react.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 64,
        "MinDmg": 58,
        "HP": 617,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.94,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 23,
        "BaseInt": 15,
        "StrGain": 1.8,
        "AgiGain": 2.65,
        "IntGain": 1.5,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.56,
        "CastPoint": 0.35,
        "CastSwing": 0.51,
        "Turnrate": 1,
        "Legs": 2
      }
    },
    {
      "ID": 51,
      "Name": "Phantom Assassin",
      "imgURL": "./img/Phantom_Assassin_icon.png",
      "Info": "Phantom Assassin is a carry renowned for her innate chance to deal massive critical damage, often killing enemies with a single swing. She specializes in hunting down vulnerable heroes, slowing them with a Stifling Dagger and leaping past defenses with Phantom Strike.",
      "Summary":"Mortred, the Phantom Assassin, is a melee agility hero fitting the role of hard carry. Mortred is best-known, and infamous for, her ability to inflict staggering damage with single strikes. Her abilities synergize supremely well with each other, rendering her an extremely formidable foe once she has acquired the items she requires. She is a very farm-dependent melee Hero, but she farms creeps with much more ease than many of her fellow carries, using her Stifling Dagger for last hitting. Besides eliminating the weakness most melee Heroes have in their farming, it also saves her from expending gold on important melee carry items like Quelling Blade. Her second ability, Phantom Strike, acts as both her escape and initiate, while Blur gives her an edge against other Heroes that depend on their physical attacks by evading them; giving her partial damage immunity to many carries. Her ultimate, the strongest critical strike in the game, is what connects Mortred with four-digit damage and what gives her a place amongst the very best support killers in the late game, since they usually fall instantly from the divine strike her ultimate provides. Mobile and able to fight back nearly every enemy that dares to face her, Mortred is a formidable foe that should never be underestimated, and with appropriate item choices and a few kills, she can snowball out of control and become next to impossible to stop.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 310,
        "MaxDmg": 48,
        "MinDmg": 46,
        "HP": 560,
        "Mana": 169,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.22,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 20,
        "BaseAgi": 23,
        "BaseInt": 15,
        "StrGain": 1.85,
        "AgiGain": 3.15,
        "IntGain": 1.4,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.5,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 52,
      "Name": "Viper",
      "imgURL": "./img/Viper_icon.png",
      "Info": "Viper is a mixed damage carry who functions as a powerful team fight hero in the midgame. Nethertoxin contaminates the ground, dealing damage and removing his opponents' passives.",
      "Summary":"Viper the Netherdrake is a ranged agility hero who can function as an excellent nuker, ganker and carry due to his assortment of low-cooldown spells and debilitating auto attacks. Farming with Viper is relatively easy—Nethertoxin makes clearing creep waves and neutral camps a cinch—and combined with Corrosive Skin, he becomes a formidable tank with high damage output; Poison Attack and Viper Strike ensure he can whittle down even the most impervious targets. In particular, Viper excels against lineups that rely on magic damage in the early-midgame. However, he needs to actively participate in team fights before opponents can afford items to counter his spells and exploit his weaknesses. Between talents, the special properties of Nethertoxin, and Poison Attack, Viper can retain his power far into the late game.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 285,
        "MaxDmg": 46,
        "MinDmg": 44,
        "HP": 560,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.94,
        "Range": 575,
        "ProjectileSpeed": 1200,
        "BaseStr": 20,
        "BaseAgi": 21,
        "BaseInt": 15,
        "StrGain": 1.9,
        "AgiGain": 2.9,
        "IntGain": 1.8,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.33,
        "AttackSwing": 1,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 53,
      "Name": "Clinkz",
      "imgURL": "./img/Clinkz_icon.png",
      "Info": "Clinkz is a great all around ranged carry with high offensive burst damage. Though frail and easy to kill, Skeleton Walk grants Clinkz stealth and haste to escape and re-position himself. This skill is also what makes Clinkz such an incredible ganker.",
      "Summary":"Clinkz, the Bone Fletcher, is a ranged agility carry specializing in ambushing lone Heroes with high physical damage and incredible speed. Though frail and easy to kill, Skeleton Walk grants Clinkz stealth and haste to escape and re-position himself. This skill is also what makes Clinkz such an incredible ganker. This assassin is also equipped with Strafe boosting his attack speed to insane levels for a short time. Searing Arrows provide huge bonus damage, greatly injuring enemies in conjunction with Strafe. To aid his assault, Clinkz can form a Death Pact and absorb a creature's life for greater damage and health, making him not only able to take more hits, but hit harder as well.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 43,
        "MinDmg": 37,
        "HP": 465,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.08,
        "Range": 630,
        "ProjectileSpeed": 900,
        "BaseStr": 15,
        "BaseAgi": 22,
        "BaseInt": 16,
        "StrGain": 1.6,
        "AgiGain": 3.3,
        "IntGain": 1.55,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.7,
        "AttackSwing": 0.3,
        "CastPoint": 0.5,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 54,
      "Name": "Broodmother",
      "imgURL": "./img/Broodmother_icon.png",
      "Info": "Broodmother is a hero who can pressure lanes early and scale well into the late game. She can Spawn Spiderlings to help her farm, find kills, and push. After Spin Web, she gains free movement, health regeneration, and movement speed.",
      "Summary":"Black Arachnia, the Broodmother, is a melee agility hero who is a notably powerful pusher. Her trademark spiderlings, as both an asset and a liability, define her play style. While a possible additional source of income, experience and lane pushes, spiderlings can easily feed opponents when not handled with deft micro and great awareness. Broodmother's abilities allow her to summon those spiderlings to do her bidding, to conceal herself and her spiderlings in an area, and to slow and kill heroes with relative ease if caught off guard, all while staying as elusive as possible with her webs and passives. She spends most of the early game pressuring a lane with little concern, due to her spiderlings and her added health regeneration, but she can also transition into a difficult to kill melee carry, which can dive in on and rapidly kill lone enemies with the right items later on.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 50,
        "MinDmg": 44,
        "HP": 503,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 17,
        "BaseAgi": 18,
        "BaseInt": 18,
        "StrGain": 2.5,
        "AgiGain": 2.2,
        "IntGain": 2,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.5,
        "CastPoint": 0.2,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 8
      }
    },
    {
      "ID": 55,
      "Name": "Weaver",
      "imgURL": "./img/Weaver_icon.png",
      "Info": "Weaver is a slippery carry who shifts in and out of space, and turns back time to recover from his injuries. Summoning The Swarm to latch onto his enemies, Weaver can drastically reduce enemy in teamfights. Weaver is extremely item dependent, and must farm well throughout the game to be effective.",
      "Summary":"Skitskurr, the Weaver, is a ranged agility hero, renowned for being one of the hardest heroes in the game to properly lock down and kill, despite his extreme frailty. This is mainly due to his low-cooldown Shukuchi ability, which provides him both max movement speed and invisibility when used, making him highly effective at chasing enemies as well as escaping from battle. Additionally, his ultimate, Time Lapse, is another survival tool, allowing Weaver to regain the position and health points he had precisely 5 seconds prior to activation. His exceptional ability to maneuver around the battle, seeking the most fragile enemy heroes, is bolstered by his last two abilities. The Swarm is a wave of insects projected in front of Weaver that latch onto any visible enemy they come across. Until they are killed off, they will gradually inflict damage over time, reduce enemy armor, and perhaps most importantly, provide vision to Weaver. Finally, Geminate Attack allows Weaver to passively launch an additional attack every few seconds, making his offensive all the more potent. Not a hero capable of standing on the front lines, Weaver is nonetheless a huge threat against a team that has little ability to prevent his extreme maneuverability.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 63,
        "MinDmg": 53,
        "HP": 465,
        "Mana": 195,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.96,
        "Range": 425,
        "ProjectileSpeed": 900,
        "BaseStr": 15,
        "BaseAgi": 14,
        "BaseInt": 15,
        "StrGain": 1.5,
        "AgiGain": 2.5,
        "IntGain": 1.8,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.8,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.64,
        "AttackSwing": 0.36,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 4
      }
    },
    {
      "ID": 56,
      "Name": "Spectre",
      "imgURL": "./img/Spectre_icon.png",
      "Info": "Spectre is a hard carry who can dominate the late game if she gets the necessary farm. Her Desolate ability lets her take on solo opponents with the upper hand, and Dispersion makes her a tanky foe who deals damage by reflecting incoming attacks.",
      "Summary":"Mercurial the Spectre is a melee agility hero, adept at dealing pure damage to lone targets, and is powerful both offensively and defensively. Spectral Dagger provides a significant amount of mobility, allowing Spectre to go through objects, units and terrain while slowing foes that come in contact with the shadowy path left by her Spectral Dagger. Desolate allows her to inflict high pure damage to enemy heroes when she catches them alone. Dispersion reduces and reflects all damage, whether by attacks or spells, to an area around her. Dispersion gives her great durability, especially when equipped with items that provide health, armor, and damage block. Finally, her Haunt creates a malevolent spectral illusion to all enemy heroes in the map. Haunt lets Spectre wreak havoc in clashes and ganks, while her allies take advantage of the confusion. Spectre can use Reality during the Haunt, instantly teleporting her to her illusion to take its form. This lets her hound her victim anywhere on the map. Mercurial is a dangerous supernatural being, relentless as she can chase and stalk down her victim to a global range, unhindered by boundaries. Her kit allows her to play the role of the team's hard carry by applying an immense amount of pressure in late game team fights. More specifically, the damage reflection from Dispersion makes it disadvantageous for teams to focus her. Her abilities have a complex nature, and newer players should generally not play Spectre as she is extremely farm and level dependent. It is best to face Spectre with allied help and strength, as encountering her alone is not always the best option.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 50,
        "MinDmg": 46,
        "HP": 541,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.22,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 19,
        "BaseAgi": 23,
        "BaseInt": 16,
        "StrGain": 2,
        "AgiGain": 2.2,
        "IntGain": 1.9,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 57,
      "Name": "Meepo",
      "imgURL": "./img/Meepo_icon.png",
      "Info": "Meepo is one of the most unique heroes in all of Dota, with the ability to split into up to five bodies. While he requires intensive micro-management, once mastered Meepo is capable of farming, pushing and ganking (maybe all at once) more successfully than most other heroes in the game.",
      "Summary":"Meepo, the Geomancer, is a melee agility hero who is notorious for being one of the hardest carries in the game to play effectively due to his heavy reliance on micromanagement. Meepo's defining ultimate, Divided We Stand, allows Meepo to create up to 3 additional clones of himself, (4 with Aghanim's Scepter), each of which has its own mana and hit points, as well as individual cooldowns on Meepo's spells. The clones cannot use any items besides the boots that the main Meepo himself wears, but each clone can gain experience and gold additively with the original Meepo, allowing him to gain levels and gold extremely fast. This means that a well-played Meepo can gain experience faster than any other hero, capable of reaching maximum level extremely early into the game and overpowering his unsuspecting opponents; however, Meepo's greatest strength is also his greatest weakness, as the death of any Meepo, including the clones, spells death for all Meepos. Individually, each Meepo is very weak, but by combining their strength and spells Meepo can overwhelm opponents with their nukes and disables. A single cast of Earthbind is little more than an inconvenience, but multiple Earthbinds chained together can allow a Meepo army to keep an enemy permanently rooted to the ground. Poof is a short-ranged area nuke by itself, but combined with the clones allows any Meepo to globally teleport to any other Meepo, and deal increasing amounts of damage when stacked together on the same target. Geostrike deals small damage over time and little slow by itself, but combining the efforts of all clones can paralyze a foe and deal heavy magical damage over time. With this skill set, Meepo can be everywhere on the map at once, and can group up on an unsuspecting victim in a moment's notice. Meepo redefines the power of numbers, and managed properly can overwhelm the enemy as a one-man army.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 45,
        "MinDmg": 39,
        "HP": 617,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 4.22,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 23,
        "BaseInt": 20,
        "StrGain": 1.6,
        "AgiGain": 1.9,
        "IntGain": 1.6,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.38,
        "AttackSwing": 0.6,
        "CastPoint": 0.5,
        "CastSwing": 0.5,
        "Turnrate": 0.65,
        "Legs": 2
      }
    },
    {
      "ID": 58,
      "Name": "Nyx Assassin",
      "imgURL": "./img/Nyx_Assassin_icon.png",
      "Info": "Nyx Assassin is a powerful roamer whose burst damage nukes allows him to quickly kill any lone heroes he encounters. While his spells provide relatively little teamfight contribution outside of Impale, his ability to kill the enemy one by one can put the enemy team at a disadvantage.",
      "Summary":"Nyx Assassin is a melee agility hero who is feared as one of the most effective gankers and solo-killers in the game. With his powerful burst damage nukes, Nyx Assassin specializes in disabling and killing lone and fragile enemies with little to no warning. He possesses an area nuke and stun ability in Impale, allowing him to disable enemies in a straight line in front of him while dealing damage. His Mana Burn ability can destroy a significant fraction of a target hero's mana pool while dealing the same amount as damage, making him the bane of weak intelligence heroes with lots of mana but very little health. Should the enemy attempt to attack him, Nyx Assassin can dissuade them with Spiked Carapace, stunning any heroes that attack him while reflecting their damage back at them. His ultimate, Vendetta, turns Nyx invisible, allowing him to deal tremendous physical damage to the next target that he strikes out of invisibility. Stalking from the shadows, Nyx Assassin can strike without warning and lay low his foes before they realize that their death is upon them.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 53,
        "MinDmg": 49,
        "HP": 522,
        "Mana": 234,
        "HPRegen": 2.5,
        "ManaRegen": 0.01,
        "Armor": 3.66,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 18,
        "BaseAgi": 19,
        "BaseInt": 18,
        "StrGain": 2,
        "AgiGain": 2.2,
        "IntGain": 2.1,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.54,
        "CastPoint": 0.4,
        "CastSwing": 1.1,
        "Turnrate": 0.5,
        "Legs": 6
      }
    },
    {
      "ID": 59,
      "Name": "Slark",
      "imgURL": "./img/Slark_icon.png",
      "Info": "Slark is an extremely slipperly melee carry. Jumping over obstacles, he Pounces on enemies and jumps away to safety, shrouding himself from damage with Shadow Dance. When unseen, Slark's natural regeneration replenishes his health.",
      "Summary":"Slark, the Nightcrawler, is a melee agility hero that utilizes his abilities to spring onto enemy heroes and slip out unhindered. He is a very mobile ganker, but remains attribute-wise below most other carries unless he is able to steal away attributes with his abilities. Once he does, though, only a few heroes can hope to be as fearsome as the Nightcrawler - extremely mobile to the point of ever-presence, his strikes only hitting harder and faster. Slark can quickly leap forward onto enemies with Pounce to leash them and bind them from escaping. His Dark Pact releases a delayed dispel that breaks even the most powerful disables. This gives him one of the most flexible abilities to start and end fights in the game. He is also capable of stealing attributes by attacking his victim to boost his own attack damage temporarily with Essence Shift, which can rapidly shift engagements in his favor, even when merely performing hit-and-run maneuvers. Slark's ultimate, Shadow Dance, allows him to remain unseen even while attacking for a short duration and allows him to move quicker when not under the watch of enemy eyes to strike in and out of enemy ranks unhindered.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 62,
        "MinDmg": 54,
        "HP": 579,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.94,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 21,
        "BaseInt": 16,
        "StrGain": 1.8,
        "AgiGain": 1.5,
        "IntGain": 1.9,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 1800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.3,
        "CastPoint": 0.001,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 60,
      "Name": "Medusa",
      "imgURL": "./img/Medusa_icon.png",
      "Info": "Medusa is a very hard carry who can easily turn teamfights around in her favor. Mana Shield makes her one of the tankiest carries in the game, but her extreme item dependence requires her to farm for much of the game before she can be effective in teamfights.",
      "Summary":"Medusa the Gorgon is a ranged agility hero. Highly item-dependent, she acts as a carry who can potentially strike down entire teams at once while protected by tank-like survivability. Split Shot allows her attacks to hit multiple targets, greatly increasing the potency of damage-granting items. Mystic Snake grants Medusa some presence in the lane and skirmishes, and its mana stealing refunds part of the cost to boot, making it an excellent farming and harassing tool. Mana Shield protects her from the opening damage of teamfights, and if supplemented with items makes killing Medusa a fatally time-consuming process. Stone Gaze acts as a fantastic defensive mechanism against ganks and initiations alike, with crippling effects on all who dare face the Gorgon.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 50,
        "MinDmg": 44,
        "HP": 446,
        "Mana": 247,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 600,
        "ProjectileSpeed": 1200,
        "BaseStr": 14,
        "BaseAgi": 20,
        "BaseInt": 19,
        "StrGain": 1.65,
        "AgiGain": 2.5,
        "IntGain": 1.85,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.6,
        "CastPoint": 0.4,
        "CastSwing": 0.5,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 61,
      "Name": "Crystal Maiden",
      "imgURL": "./img/Crystal_Maiden_icon.png",
      "Info": "Crystal Maiden is an efficient support who specializes in slowing enemies. Her highly valued Arcane Aura increases mana regeneration for all her teammates, while she remains effective throughout the game with very little items.",
      "Summary":"Rylai, the Crystal Maiden, is a ranged intelligence hero who uses the power of frost and ice to cope with her foes. Renowned as a well-balanced hard support, Crystal Maiden possesses strong nukes and disables that allow her to apply strong slows to enemies. Crystal Nova is a powerful area-of-effect nuke that slows both attack and movement speeds of enemies within an area for several seconds, while Frostbite encases an enemy in a block of ice for several seconds, immobilizing them and dealing moderate damage per second. Combining these two abilities together along with a laning partner's own spells is often enough to bring an enemy hero to their knees. Her Arcane Aura passive will also regenerate mana for Rylai and her allies, greatly boosting their ability to cast spells in the early game. Although her strong early game presence can be countered by her extreme frailty and poor mobility, she can still inflict a heavy amount of damage in teamfights later on if she is able to channel her deadly ultimate, Freezing Field. Her global mana aura, strong disabling and nuking prowess, simple spell layout, and almost complete lack of item dependence make Crystal Maiden a reliable support caster that can be a strong asset to any team, and judicious use of her ultimate allows her to lay waste to her enemies when used properly. With protection from her team and appropriate item selection, she can be the only support any team needs.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 280,
        "MaxDmg": 44,
        "MinDmg": 38,
        "HP": 484,
        "Mana": 273,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 16,
        "BaseAgi": 16,
        "BaseInt": 16,
        "StrGain": 1.7,
        "AgiGain": 1.6,
        "IntGain": 2.9,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.55,
        "AttackSwing": 0,
        "CastPoint": 0.3,
        "CastSwing": 2.4,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 62,
      "Name": "Puck",
      "imgURL": "./img/Puck_icon.png",
      "Info": "Puck is an extremely elusive hero who misleads and disrupts enemies with a combination of disabling items and abilities. Though vulnerable, Puck is able to initiate on enemy teams, silencing and locking down opponents before teleporting away in a glowing orb.",
      "Summary":"Puck, the Faerie Dragon, is a highly mobile ranged intelligence hero best known for being an extremely unpredictable and slippery target. Puck is commonly played as an initiator and ganker, with spells that are equally useful for super-aggressive maneuvers as well as daring escapes. Expert use of Puck's abilities will let you appear out of nowhere, suddenly leave your enemies crippled and disadvantaged, and get away in the blink of an eye - but mess up your timing or misjudge the situation, and there is little left to save this fragile Hero from death.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 58,
        "MinDmg": 47,
        "HP": 465,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.08,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 15,
        "BaseAgi": 22,
        "BaseInt": 24,
        "StrGain": 1.7,
        "AgiGain": 1.7,
        "IntGain": 2.4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.8,
        "CastPoint": 0.1,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 63,
      "Name": "Storm Spirit",
      "imgURL": "./img/Storm_Spirit_icon.png",
      "Info": "Storm Spirit is a very mobile ganker who thrives on an aggressive play style. While he is very mana-hungry and difficult to master, he more than makes up for this by rewarding players with aggressive mindsets and good dexterity, who can use his abilities to jump on foes from extremely long distances.",
      "Summary":"Raijin Thunderkeg, the Storm Spirit, is a ranged intelligence hero who wields the elemental power of lightning. He has high mobility, strong ganking and carrying potential, and very good synergy between his hero abilities. Static Remnant creates an immobile clone of himself that, upon contact with an enemy, shocks all enemies in a small area for damage. It has a very low cooldown, making it a good farming skill. Electric Vortex binds an enemy to himself, drawing it in slowly; at higher levels of the skill, it will always be able to pull the target into a Static Remnant. Overload further supplements this combo by harnessing the excess charge whenever Raijin casts a spell, adding it in the form of magical damage to his next attack and zapping enemies in a radius around the target. Finally, Storm Spirit's ultimate and signature skill is Ball Lightning, in which he transforms into pure energy, sacrificing his own mana to dash quickly around the map in an invulnerable state, inflicting minor damage to foes he impacts as well as giving him an Overload charge. It can be used to initiate and escape long distances with ease. Since his ultimate disjoints enemy projectiles and has no cooldown, he can prove to be one of the most slippery foes in the game, provided that he has enough mana regeneration to sustain it and/or the enemy team does not have strong disables such as stuns and silences. However, without proper mana management, he will run out of juice very quickly and become a sitting duck. While extremely vulnerable early game before he acquires his ultimate, once he does so, if he gets a few quick kills and some mana-sustaining items, he will become an unstoppable force of nature.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 55,
        "MinDmg": 45,
        "HP": 541,
        "Mana": 299,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 5.08,
        "Range": 480,
        "ProjectileSpeed": 1100,
        "BaseStr": 19,
        "BaseAgi": 22,
        "BaseInt": 23,
        "StrGain": 1.5,
        "AgiGain": 1.8,
        "IntGain": 2.6,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.3,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.8,
        "Legs": 2
      }
    },
    {
      "ID": 64,
      "Name": "Windranger",
      "imgURL": "./img/Windranger_icon.png",
      "Info": "Windranger is a very flexible hero who can be played in any lane, and who can perform many roles from support-disabler to DPS carry.",
      "Summary":"Lyralei the Windranger is a ranged intelligence hero that uses powerful abilities in conjunction with her physical attack to take down enemies. Despite being an intelligence Hero, Windranger's playstyle resembles that of an agility Hero, due in large part to her skill set. Windranger is most often played as an offlane solo due to her escape, long range harass, and farm capability; however, she is quite versatile and can be fielded as a midlaner, roamer, lane support, or even a carry, if the game calls for it. She is famous for her immense utility and versatility.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 56,
        "MinDmg": 44,
        "HP": 465,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.38,
        "Range": 600,
        "ProjectileSpeed": 1250,
        "BaseStr": 15,
        "BaseAgi": 17,
        "BaseInt": 22,
        "StrGain": 2.5,
        "AgiGain": 1.4,
        "IntGain": 2.6,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.5,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.3,
        "CastPoint": 0.3,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 65,
      "Name": "Zeus",
      "imgURL": "./img/Zeus_icon.png",
      "Info": "Zeus is an intelligence based hero played solely as a nuker. He has the highest magical damage output of any hero in the game and his strongest aspect is his early to mid game dominance as well as a extremely strong late game.",
      "Summary":"Zeus, the Lord of Heaven, is a ranged intelligence hero who functions almost solely as a nuker. He is usually played as a semi-carry ganker type hero, who instead of utilizing disables, focuses solely on delivering tremendous amounts of magical damage to his foes. With the high cast range, and ease of use and low cooldown on his spells, he is able to deliver the most superb and consistent magical damage of any hero in the game. Arc Lightning is a highly spammable nuke that creates a stream of lightning that bounces between enemy foes (up to fifteen times at max level), dealing minor damage. Lightning Bolt is more focused, dealing heavy damage to a single target, also on a very low cooldown. It can also be targeted on the ground, providing vision and True Sight and potentially striking a nearby enemy, making him effective even against fogged and invisible enemies as well and allowing him to locate enemy wards. Static Field is a potent passive ability that allows Zeus's magical damage to scale into late game, dealing damage to all enemies within a decent AoE equal to a certain percentage of nearby targets' health whenever he casts a spell. Finally, his ultimate Thundergod's Wrath allows him to strike all enemy heroes with a bolt of lightning, no matter their position, inflicting heavy damage. It can be used for multiple purposes: to finish off low-health enemy heroes limping away, to soften up the entire enemy team during a teamfight, or even to scout out the enemy's position. With the ability to strike down enemies both near and afar, the Lord of Heaven ensures that nobody can escape his wrath.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 49,
        "MinDmg": 41,
        "HP": 541,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.54,
        "Range": 350,
        "ProjectileSpeed": 1100,
        "BaseStr": 19,
        "BaseAgi": 11,
        "BaseInt": 20,
        "StrGain": 2.3,
        "AgiGain": 1.2,
        "IntGain": 2.7,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.633,
        "AttackSwing": 0.366,
        "CastPoint": 0.4,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 66,
      "Name": "Lina",
      "imgURL": "./img/Lina_icon.png",
      "Info": "Lina is a powerful ranged intelligence hero that can be played as a support or a semi-carry. Her abilities allow her to nuke and stun multiple heroes at once and her strong ultimate can annihilate low health heroes. Her passive allows her right-clicks to far exceed that of other typical intelligence heroes.",
      "Summary":"Lina the Slayer is a ranged Intelligence hero, adept at destroying enemy heroes quickly by delivering massive bursts of magical damage, making her one of the most effective gankers in the game. She possesses immense damaging capabilities all throughout the game, but is very fragile. Two of her fiery spells are her main source of damage, Dragon Slave sends a wave of fire to burn enemies in her path while Light Strike Array stuns them with a concentrated pillar of solar flame. Each of her spells deals great damage early on and has a low cooldown. Her Fiery Soul bolsters her attack and movement speed every time she casts a spell, which gives her scaling damage for the later game. Laguna Blade, her ultimate, is her ace in the hole. Lina fires off a huge bolt of lightning at a single target, dealing colossal damage. Laguna Blade's damage is staggering in early-mid game, and late game is still enough to destroy frail enemy heroes. Dragon Slave, Light Strike Array, and Laguna Blade are incredible flaming nukes that can incinerate her target instantly, and Fiery Soul allows her to transition into a strong and fast physical attacker. Though her power falls from its peak late game, mana-boosting and damage-increasing items can be purchased to keep herself up.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 58,
        "MinDmg": 40,
        "HP": 522,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 670,
        "ProjectileSpeed": 1000,
        "BaseStr": 18,
        "BaseAgi": 16,
        "BaseInt": 27,
        "StrGain": 1.5,
        "AgiGain": 1.5,
        "IntGain": 3.2,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.75,
        "AttackSwing": 0.78,
        "CastPoint": 0.45,
        "CastSwing": 1.08,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 67,
      "Name": "Shadow Shaman",
      "imgURL": "./img/Shadow_Shaman_icon.png",
      "Info": "Shadow Shaman is a very powerful ganker and pusher, who possesses very strong disables and nukes. His spells allow him to disable lone enemies for extended periods of time, making them easy prey for his teammates, or to make short work of creep waves and towers.",
      "Summary":"Rhasta, the Shadow Shaman, is a ranged intelligence hero mostly used as a pusher and disabler, wielding abilities that make pushing lanes more efficient. When his abilities are used in intelligent combos, he has one of the longest disables in game. He is also capable of disabling multiple enemy heroes, allowing him to initiate encounters as well. Though very supportive in nature, until the late game Rhasta is capable of killing lone enemy heroes with the use of his entire skill set; meaning he is more difficult to gank than most other supports. Playing Rhasta well requires good knowledge of target priority and timing; and some minor micromanagement. His peak is mid-game, but he can continue to wreak havoc on enemies all throughout the match.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 285,
        "MaxDmg": 54,
        "MinDmg": 47,
        "HP": 541,
        "Mana": 273,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 500,
        "ProjectileSpeed": 900,
        "BaseStr": 21,
        "BaseAgi": 16,
        "BaseInt": 21,
        "StrGain": 1.8,
        "AgiGain": 1.6,
        "IntGain": 3,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 1.07,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 68,
      "Name": "Tinker",
      "imgURL": "./img/Tinker_icon.png",
      "Info": "Tinker is a very mobile nuking hero with powerful pushing and disabling potential depending on how he is built. He should be played around his ultimate, as it allows him to cast his spells and use his abilities multiple times in a single engagement.",
      "Summary":"Boush, the Tinker, is a ranged intelligence hero who relies heavily on his assortment of nukes for ganking and pushing. While he does have rather low stat gain, he is able to reset the cooldown on his abilities, which in conjunction with Boots of Travel gives Tinker global mobility rivaled only by Nature's Prophet, which combined with his two high damage nukes, Laser and Heat-Seeking Missile, makes him a constant threat. Tinker abilities' mana costs are very high, however, thanks to his ultimate Rearm, and Boots of Travel, Tinker can simply to go back to base to refill health and mana, Rearm and go back to the lane to push or gank once more. Acquiring said boots early with a level advantage is key to success, considering he is lackluster without them. With the right items, mana management, and ability management, in the right hands, there is little that stands in the way of this hero.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 55,
        "MinDmg": 49,
        "HP": 503,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.82,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 13,
        "BaseInt": 27,
        "StrGain": 2,
        "AgiGain": 1.2,
        "IntGain": 2.2,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.65,
        "CastPoint": 0.53,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 69,
      "Name": "Nature's Prophet",
      "imgURL": "./img/Nature's_Prophet_icon.png",
      "Info": "Nature's Prophet is a very unorthodox hero most renowned for his ability to push and gank, as his combination of abilities gives him powerful global presence and pushing potential. However, the hero himself is quite frail and can be killed easily if caught by the enemy.",
      "Summary":"Nature's Prophet is a ranged intelligence hero, whose play style is different from most intelligence heroes, because he can be almost anywhere at any given time with his Teleportation. This ability allows him to participate in most ganks and pushes at a moment's notice. With Sprout, he creates a ring of trees, trapping anyone within them in place, serving to disable anyone caught within them. The trees around him serve as his objects of power; using them, he summons sentient tree beings known as Treants from trees on the map with his Nature's Call ability. Wrath of Nature is the main and only directly damaging spell in his arsenal, but it can potentially be very powerful, as it can inflict increased damage with each bounce off subsequent enemies and can clear out multiple creep waves with its moderate cooldown and mana cost. Commonly played as a ganker, offlaner and jungler and known as a strong pusher, Nature's Prophet has superb farming capabilities and global presence, giving him the power to be anywhere on the map. Late-game, Nature's Prophet makes himself useful by constantly distracting and annoying the enemy team by pushing. If attention is not given to him, he can single-handedly win the game by constantly taking several towers or even the Ancient.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 59,
        "MinDmg": 45,
        "HP": 541,
        "Mana": 273,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.52,
        "Range": 600,
        "ProjectileSpeed": 1125,
        "BaseStr": 19,
        "BaseAgi": 18,
        "BaseInt": 25,
        "StrGain": 1.8,
        "AgiGain": 1.9,
        "IntGain": 2.9,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.77,
        "CastPoint": 0.5,
        "CastSwing": 1.17,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 70,
      "Name": "Enchantress",
      "imgURL": "./img/Enchantress_icon.png",
      "Info": "Enchantress is a flexible intelligence hero that can be an effective jungle hero with focus in ganking and pushing in early stages of the game. Enchant icon.png Enchant allows her to control neutral creeps, gaining access to their abilities and auras.",
      "Summary":"Aiushtha the Enchantress is a ranged intelligence hero who uses her abilities to push through lanes and gank with relative ease. Enchantress works well as a jungler in the early game, as it maximizes the effectiveness of her Enchant and Untouchable abilities. On first glance, she may be just a support, serving her allies with powerful heals, creep abilities and slows, but as time goes on, her power increases and once she has her ultimate, Enchantress' regular attacks are strong enough to kill most heroes with a couple of attacks, if they stand far enough, and make her a potential carry.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 335,
        "MaxDmg": 57,
        "MinDmg": 47,
        "HP": 484,
        "Mana": 208,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.66,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 16,
        "BaseAgi": 19,
        "BaseInt": 16,
        "StrGain": 1,
        "AgiGain": 1.8,
        "IntGain": 2.8,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 4
      }
    },
    {
      "ID": 71,
      "Name": "Jakiro",
      "imgURL": "./img/Jakiro_icon.png",
      "Info": " Jakiro is a tanky intelligence hero with low cooldown damage over time spells and high amounts of magic damage. He offers a large amount of teamfight with Ice Path and Macropyre ,and push with Dual Breath and Liquid Fire.",
      "Summary":"Jakiro the Twin Head Dragon is a ranged intelligence hero who utilizes the powers of ice and fire with powerful linear area spells. He can freeze enemies in place with Ice Path, or slow them down with Dual Breath. He is capable of dealing heavy damage throughout the game by locking enemies inside his Macropyre, and provides great pushing power with Liquid Fire. With high base attribute gain and relatively low mana costs, he requires few items to be effective. Jakiro is a support who can continually turn battles in his favor with good positioning. His high strength gain makes him a bit tougher than most spellcasters and his low cooldowns ensure that his downtime is very minuscule, making him a great hero for ganks, pushes and clashes across the battlefield.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 61,
        "MinDmg": 53,
        "HP": 636,
        "Mana": 364,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.4,
        "Range": 400,
        "ProjectileSpeed": 1100,
        "BaseStr": 25,
        "BaseAgi": 10,
        "BaseInt": 28,
        "StrGain": 2.3,
        "AgiGain": 1.2,
        "IntGain": 2.8,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.5,
        "CastPoint": 0.65,
        "CastSwing": 0.3,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 72,
      "Name": "Chen",
      "imgURL": "./img/Chen_icon.png",
      "Info": "Chen is a support who is one of the strongest junglers in the game, and can use his persuaded creeps (thanks to Holy Persuasion) to gank and push very early in a game. Chen is able to weaken his adversaries with his Penitence.",
      "Summary":"Chen, the Holy Knight, is a ranged intelligence hero, renowned as a support that is difficult to learn due to heavy reliance on micromanagement, but once mastered can become a powerful ganker and one of the strongest early pushers in the game. His ability Holy Persuasion allows him to convert enemy and neutral creeps to his side, controlling them and using their abilities to his advantage. This makes him a strong jungler, and allows him to use those creeps' abilities during ganks to disable unwary enemies. Holy Persuasion is also a strong utility spell that allows Chen to save his teammates from death by sending them back to his team's fountain, or to summon his flock to himself. To further aid his ability to gank, Chen has access to Penitence, which allows him to slow his foes while increasing the amount of damage they take, and Test of Faith, an unpredictable but strong Pure damage nuke. Finally, his ultimate, Hand of God, is able to instantly heal all allies and units under Chen's control, globally all over the battlefield, allowing him to push and support no matter where he is.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 53,
        "MinDmg": 48,
        "HP": 560,
        "Mana": 273,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 600,
        "ProjectileSpeed": 1100,
        "BaseStr": 23,
        "BaseAgi": 15,
        "BaseInt": 21,
        "StrGain": 1.5,
        "AgiGain": 2.1,
        "IntGain": 2.8,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 6
      }
    },
    {
      "ID": 73,
      "Name": "Silencer",
      "imgURL": "./img/Silencer_icon.png",
      "Info": "Silencer is an intelligence-based teamfight-oriented hero that scales exceptionally well thanks to his innate ability Intelligence Steal. He is able to render any magic user useless with hisLast Word and Arcane Curse. His signature ultimate, Global Silence can make a swift table turns in teamfight.",
      "Summary":"Nortrom, the Silencer, is a ranged intelligence hero who can be played as a support, carry, or initiator. He is one of the few intelligence heroes that truly benefit from intelligence items and is effective against heroes that rely mostly on spells, as he can silence them while stealing their intelligence and adding it to his own. He is a notorious anti-caster hero who can disrupt the magical abilities of his enemies and cripple spellcasters throughout the game. Arcane Curse slows and causes enemies to lose health for a set duration, but increases with each spell the enemy casts, forcing them to either wait and cast no spell until it expires, or cast spells and prolong the debuff and thus take more damage. Last Word places a curse on Nortrom's target that damages and silences for a long duration if the target casts a spell. If the target does not cast a spell before the curse duration ends the effects are the same. Glaives of Wisdom is an active attack modifier that deals a percentage of Nortrom's intelligence as pure damage. Nortrom's ultimate, Global Silence, silences all enemy units on the map for a few seconds. A well-timed Global Silence can be used to save yourself or an ally, initiate a teamfight, or ruin the enemy's initiation. Silencer has the unique innate ability, Intelligence Steal, which permanently steals the intelligence of enemy heroes that die near him or are directly killed by him and adds it to his own. This rewards his presence in teamfights, also making his glaives ever stronger as the battle goes on.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 57,
        "MinDmg": 43,
        "HP": 503,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 600,
        "ProjectileSpeed": 1000,
        "BaseStr": 17,
        "BaseAgi": 16,
        "BaseInt": 27,
        "StrGain": 2.2,
        "AgiGain": 3,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 74,
      "Name": "Ogre Magi",
      "imgURL": "./img/Ogre_Magi_icon.png",
      "Info": "Ogre Magi is the embodiment of dumb muscle. While having a meager mana pool for an intelligence hero, his health pool can become one of the largest in the game. Not needing very many items, Ogre is potent at all points in the game.",
      "Summary":"Aggron Stonebreak, the Ogre Magi, is a melee intelligence hero, famous for his random potential for extreme burst damage and his enormous health pool for an intelligence hero. He has good base attributes, and some of the best attributes gain in the game, having a very high base strength, as well as the highest strength gain of any intelligence hero by far. Coupled with his high base armor and high health regeneration, Ogre Magi is very hard to take down in the early game. He is a powerful ganker and disabler, slowing his enemies first with an Ignite, then proceeding to eliminate his opponents with Fireblast. Later in the game he takes on the role of a buffer/debuffer with his powerful Bloodlust buff, buffing his carry's damage potential enormously. And if you happen to be skilled enough, his ultimate Multicast gives him the opportunity to randomly cast his spells multiple times, allowing for great burst potential. Ogre Magi is a very strong disabler, requiring nothing but a bit of luck to successfully pull off his powerful Multicasts.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 295,
        "MaxDmg": 64,
        "MinDmg": 58,
        "HP": 617,
        "Mana": 221,
        "HPRegen": 3.5,
        "ManaRegen": 0.01,
        "Armor": 7.96,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 14,
        "BaseInt": 17,
        "StrGain": 3.2,
        "AgiGain": 1.55,
        "IntGain": 2.4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.45,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 75,
      "Name": "Rubick",
      "imgURL": "./img/Rubick_icon.png",
      "Info": "Rubick is a flexible spellcaster, best known for his ability to copy enemies last used spells to use against them. He is commonly picked as a counter to big teamfight spells.",
      "Summary":"Rubick, the Grand Magus, is a ranged intelligence hero best known for his ability to copy the spells of his enemies and use them as his own. Although he is mostly played as a support and is extremely fragile the entire length of the game, he can still prove to be one of the most influential heroes if he utilizes good positioning and well-timed usage of his ultimate, Spell Steal. Spell Steal allows Rubick to cast an enemy hero's most recently used spell, giving him supreme versatility throughout the game. By stealing the right abilities, the Grand Magus can aid himself and allies by casting crippling disables, applying curses, unleashing powerful nukes, disorienting the enemy team, supporting his allies with buffs, escaping from rough situations, or even enhancing his own physical attacks. His other abilities are just as worthy of a Magus: Telekinesis lets Rubick magically lift an enemy into the air, rendering the target helpless and vulnerable, before hurling the lifted enemy to the ground up to a short distance away and stunning nearby foes on impact. Fade Bolt blasts enemies with a stream of arcane energy which bounces to all enemies nearby, dealing damage and reducing their attack damage. Null Field is a passive aura, which grants himself and nearby allies bonus magic resistance to shrug off magical assaults. Rubick's versatile ability-set and his infamous Spell Steal make him a flexible and powerful hero that can work in any lineup although he does suffer from long cooldowns and the surfacing predictability of his ultimate.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 54,
        "MinDmg": 44,
        "HP": 541,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.96,
        "Range": 600,
        "ProjectileSpeed": 1125,
        "BaseStr": 19,
        "BaseAgi": 14,
        "BaseInt": 27,
        "StrGain": 1.5,
        "AgiGain": 1.6,
        "IntGain": 2.4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.77,
        "CastPoint": 0.1,
        "CastSwing": 1.17,
        "Turnrate": 0.5,
        "Legs": 2
      }
    }, 
    {
      "ID": 76,
      "Name": "Disruptor",
      "imgURL": "./img/Disruptor_icon.png",
      "Info": "Disruptor is a strong teamfight hero who can control the enemy team's positioning with his potent disables. His Kinetic Field can prevent enemies from leaving the area after being set up, and when used in conjunction with Static Storm can silence and disrupt enemies.",
      "Summary":"Disruptor, the Stormcrafter, is a ranged intelligence hero who requires good positioning to use his abilities effectively. His signature ability is Kinetic Field, a pseudo-disable that traps enemies within a small area for a long duration. Combined with his Static Storm, Disruptor can act as the initiator for a teamfight, or supplement his teammates' initiation very well. Glimpse is another powerful spell that forces enemies to watch their movements, as Disruptor can easily drag them back to a previous location to be focused down. Thunder Strike provides Disruptor with some reliable single-target damage, but more importantly grants vision on the target to prevent jukes and escapes.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 300,
        "MaxDmg": 53,
        "MinDmg": 49,
        "HP": 541,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 600,
        "ProjectileSpeed": 1200,
        "BaseStr": 19,
        "BaseAgi": 15,
        "BaseInt": 22,
        "StrGain": 1.9,
        "AgiGain": 1.4,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.5,
        "CastPoint": 0.05,
        "CastSwing": 1,
        "Turnrate": 0.5,
        "Legs": 4
      }
    },
    {
      "ID": 77,
      "Name": "Keeper of the Light",
      "imgURL": "./img/Keeper_of_the_Light_icon.png",
      "Info": "Keeper of the Light works as an adept support who can aid his allies and hinder his enemies with his array of abilities. He can babysit to greatly augment the power of a lane, and transition into a pusher and counter-pusher past the laning stage.",
      "Summary":"Ezalor the Keeper of the Light is a ranged Intelligence Hero famous for his reputation as a one-man support team. Supporting his allies in need, and pushing unguarded lanes with ease, Ezalor is a very valuable ally for any team. Having a variety of useful abilities, he can channel a powerful globe of intense light that can heavily damage an army of enemy creeps in the lane, allowing for an easy push; and manipulate the mana around him, restoring mana for himself and his allies or draining the mana of his enemy. His Ultimate allows him to gain his full power, giving Ezalor access to 2 sub-abilities and an improved existing ability, giving him six different abilities in total. Keeper of the Light requires patience, confidence, and selfless behavior to play him well, as he is played as a support instead of a killer caster like most Intelligence gankers. His wide set of abilities also requires good timing, reflexes, and knowledge to use well.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 54,
        "MinDmg": 38,
        "HP": 446,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 14,
        "BaseAgi": 15,
        "BaseInt": 22,
        "StrGain": 1.8,
        "AgiGain": 1.6,
        "IntGain": 2.8,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.85,
        "CastPoint": 0.3,
        "CastSwing": 2.4,
        "Turnrate": 0.5,
        "Legs": 6
      }
    }, 
    {
      "ID": 78,
      "Name": "Bane",
      "imgURL": "./img/Bane_icon.png",
      "Info": "Bane is a very powerful single-target disabler who possesses reasonable nuking power. His strongest suit is setting up kills for teammates with high damage output or unreliable stuns, making him a powerful roamer and ganker who can assist teammates in getting kills throughout a match.",
      "Summary":"Atropos the Bane Elemental, also known simply as Bane, is a ranged intelligence Hero, possessing dark and nightmarish abilities that give him strong disabling, ganking, and nuking prowess. Mostly played as a support, he has some of the highest starting stats of any hero, yet is unique in the sense that all his attributes and stat growths are equivalent. In addition, he possesses four highly potent single-target spells, which if used properly can more than make up for his complete lack of area of effect presence and pushing power. Enfeeble reduces the target's attack damage by a tremendous amount, which can highly reduce an attack-reliant enemy hero's effectiveness from as early as the laning stage all the way to the endgame. Brain Sap is a nuke that deals hefty pure damage to the target, healing himself for the same amount as well. Nightmare puts a unit to sleep, completely disabling for several seconds, but if the slept target is physically attacked, it wakes up and the spell transfers to the attacker (unless it is Bane himself), while spells will also wake the target up, but will not transfer the effect to the caster. Finally, Bane's Fiend's Grip is a channeling spell that completely disables the target for several seconds, dealing heavy damage per second and giving Bane some mana back as well. Bane's debilitating lockdown abilities are what make him an invaluable support to allies, and a feared one for enemies.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 310,
        "MaxDmg": 61,
        "MinDmg": 55,
        "HP": 598,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.52,
        "Range": 400,
        "ProjectileSpeed": 900,
        "BaseStr": 22,
        "BaseAgi": 22,
        "BaseInt": 22,
        "StrGain": 2.1,
        "AgiGain": 2.1,
        "IntGain": 2.1,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.5,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 0
      }
    },
    {
      "ID": 79,
      "Name": "Lich",
      "imgURL": "./img/Lich_icon.png",
      "Info": "Lich is a ranged intelligence hero who can win the laning stage of the game with Sacrifice that denies the opponent experience points and gives them to Lich and his allies. With the mana restored from Sacrifice, Lich can use Frost Blast to nuke down enemies",
      "Summary":"Ethreain, the Lich, is a ranged intelligence hero that uses his abilities to slow his enemies down with his ice-based attacks, as well as giving a boost to ally defenses, and serves as a great teamfight ganker with his powerful ultimate. He can use Sacrifice to easily level up and keep his mana high, making him very good at harassing in the early stages of the game. While a relatively frail hero and mostly known as a support, he can prove to be a force to be reckoned and mighty foe to stand with as he can render the attempts of multiple enemies futile with his ultimate, Chain Frost. Lich is a powerful crowd controller and can easily turn a teamfight, or dominate in a lane.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 51,
        "MinDmg": 42,
        "HP": 522,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 18,
        "BaseAgi": 15,
        "BaseInt": 18,
        "StrGain": 1.55,
        "AgiGain": 2,
        "IntGain": 3.25,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.54,
        "CastPoint": 0.4,
        "CastSwing": 1.1,
        "Turnrate": 0.5,
        "Legs": 0
      }
    }, 
    {
      "ID": 80,
      "Name": "Lion",
      "imgURL": "./img/Lion_icon.png",
      "Info": "Lion is a powerful spellcaster and is mostly played as support or ganker hero due to his disabling spells. He is best to partner with auto attack carries or another spellcaster to finish enemies quickly. His Earth Spike and his Hex make him a formidible disabler.",
      "Summary":"Lion, the Demon Witch, is a ranged intelligence hero, most commonly played as a support, who serves as a powerful offensive spellcaster. While exceptionally frail and vulnerable at all stages of the game due to his low health pool, armor, and movespeed, he has a tremendous amount of disabling and nuking power, allowing him to provide the necessary lockdown and burst damage to his team to bring down elusive and shifty enemies. Earth Spike is an area-of-effect line-based stun that also deals a moderate amount of damage. If Lion uses it at max level combined with his Hex, which briefly transfigures an enemy into a harmless critter, he can disable a single opponent for almost 7 seconds, more than enough time to bring down a lone enemy, especially if an ally is present. His ultimate, Finger of Death, serves as a powerful nuke and his primary source of burst damage to aid him in his endeavors. To offset the high mana cost of his abilities, he has Mana Drain, which provides him the sustenance he needs to continuously provide his disabling prowess in a skirmish. A team facing a Lion would do well to eliminate him first in a fight, lest it fall prey to his potent and disruptive spells.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 55,
        "MinDmg": 49,
        "HP": 484,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.1,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 16,
        "BaseAgi": 15,
        "BaseInt": 22,
        "StrGain": 1.7,
        "AgiGain": 1.5,
        "IntGain": 3,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.43,
        "AttackSwing": 0.74,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    }, 
    {
      "ID": 81,
      "Name": "Witch Doctor",
      "imgURL": "./img/Witch_Doctor_icon.png",
      "Info": "Witch Doctor is a strong support that scales well throughout the game. If well positioned can change the flow of battle with his ultimate.",
      "Summary":"Zharvakko, the Witch Doctor, is a ranged intelligence hero who can take on the role of a support or a ganker. A master of voodoo curses and healing arts, he possesses several positioning-dependent crowd control/damage spells as well as a heal that scales well into the late game. Maledict is one of the most powerful damaging spells in the game, and is fittingly enough quite hard to hit properly - but when applied at the right time, Malediction can curse someone to suffer a slow, humiliating death as they limp back towards safety. Paralyzing Cask is a somewhat-unreliable stun that requires multiple enemies to bounce between to be effective, but can provide a barrage of stuns to the enemy team if they are grouped together. Death Ward has the potential to be one of the most damaging ultimates in the game as long as he is able to channel the spell uninterrupted.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 61,
        "MinDmg": 51,
        "HP": 484,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.82,
        "Range": 600,
        "ProjectileSpeed": 1200,
        "BaseStr": 16,
        "BaseAgi": 13,
        "BaseInt": 24,
        "StrGain": 1.8,
        "AgiGain": 1.4,
        "IntGain": 2.9,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.5,
        "CastPoint": 0.35,
        "CastSwing": 0.52,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 82,
      "Name": "Enigma",
      "imgURL": "./img/Enigma_icon.png",
      "Info": "Enigma is a tactical spellcaster who is known for his incredibly powerful ultimate, Black Hole. Playing him well requires efficient farming, control of Demonic Conversion and good positioning to get the most mileage out of his gravitational abilities.",
      "Summary":"Enigma is a ranged intelligence hero who uses his abilities to cripple his enemies, supported by a seemingly inexhaustible army of creeps. His fearsome abilities can bind entire teams under his might. Enigma is also a formidable jungler and pusher owing to his ability to create creeps. The deliverance of his ultimate, Black Hole, engulfs an area around him with dark energies and disables enemies caught within it, making him an extremely powerful yet conditional initiator and disabler. His Midnight Pulse consumes sections of enemies' life in a region over time and his Malefice stuns targets. His trademark ability is Demonic Conversion, which splits a creep into three eidolons under his control. If they can land enough attacks on an enemy unit before their expiration, they multiply and are healed to full health.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 48,
        "MinDmg": 42,
        "HP": 503,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.96,
        "Range": 500,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 14,
        "BaseInt": 20,
        "StrGain": 2.1,
        "AgiGain": 1,
        "IntGain": 3.4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.77,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 83,
      "Name": "Necrophos",
      "imgURL": "./img/Necrophos_icon.png",
      "Info": "Necrophos is a strong nuker and tanky hero who is capable of surviving long teamfights and picking off key enemy heroes with Reaper's Scythe. His Death Pulse is able to heal/damage allies/enemies, Ghost Shroud is able to chase fleeing heroes",
      "Summary":"Rotund'jere, the Necrophos, is a ranged intelligence hero. His abilities are most effective in team fights where he can damage enemies and heal allies simultaneously, while picking off key enemy heroes with his ultimate. Necrophos is most dangerous when his enemy is severely injured, instantly killing them with his ultimate while recovering over time after killing his foe. Necrophos is naturally fragile, but his mechanics require him to stay in the midst of encounters; it is for this reason that he depends on items to prevent his death. Ideally, by casting Death Pulse repeatedly, he and his team are able to stay alive, while regenerating his health and mana for each life his takes, while the enemy team's health is gradually decaying by those same pulses and his Heartstopper Aura, which reduces enemy health by a small percentage each second. Because his abilities are suited to prolonged encounters, he must build items which allow him to survive for as long as possible against his enemies, as well as utilizing his Ghost Shroud to dodge physical damage and crippling the movement of his enemies, allowing his team to catch up and surround them. When the time is right, his ultimate, Reaper's Scythe, has its damage increased by how much of their maximum health the target is missing; meaning that an enemy that is close to death will be killed outright by it. Necrophos is best understood as a hero who is weak at the beginning of a fight but becomes more dangerous with each passing second.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 49,
        "MinDmg": 45,
        "HP": 484,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.1,
        "Range": 550,
        "ProjectileSpeed": 900,
        "BaseStr": 16,
        "BaseAgi": 15,
        "BaseInt": 22,
        "StrGain": 2,
        "AgiGain": 1.7,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.77,
        "CastPoint": 0.7,
        "CastSwing": 0.8,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 84,
      "Name": "Warlock",
      "imgURL": "./img/Warlock_icon.png",
      "Info": "Warlock is a powerful spellcaster capable of turning the tide of teamfights, bringing Hell powers with his abilities, Fatal Bonds his enemies to suffer with the same catastrophic fate. He is almost entirely dependent on good positioning, due to lack of front line abilities.",
      "Summary":"Demnok Lannik the Warlock is a ranged intelligence hero who possesses many powerful teamfight spells capable of inflicting chaos upon the enemy team. Shadow Word is a highly versatile spell, as it allows him to support allies by healing them or harass enemies by dealing damage over time, giving him strong lane presence. Beyond the early game, Warlock can turn any teamfight in his team's favor as his other spells are strong when unleashed against multiple enemies. Fatal Bonds causes all enemies linked together to take bonus damage when one of their number takes damage, magnifying the strength of area-of-effect spells, while Upheaval can allow him to greatly slow any enemies caught in the radius of the spell, making it harder for them to maneuver in fights or escape. His ultimate, Chaotic Offering, summons a Golem after stunning all enemies in a wide area, allowing him to throw them into disarray. While unassuming and weak by himself, Warlock is a dangerous threat in any teamfight as his spells allow him to turn the enemies' numbers against them and sow chaos amongst their ranks.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 56,
        "MinDmg": 46,
        "HP": 522,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.4,
        "Range": 600,
        "ProjectileSpeed": 1200,
        "BaseStr": 22,
        "BaseAgi": 10,
        "BaseInt": 24,
        "StrGain": 2.5,
        "AgiGain": 1,
        "IntGain": 2.7,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.5,
        "CastSwing": 0.5,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 85,
      "Name": "Queen of Pain",
      "imgURL": "./img/Queen_of_Pain_icon.png",
      "Info": "Queen of Pain is a fearsome mid laner who has impressive mobility through Blink, along with several spells that deal significant damage. Despite her sizeable amounts of damage, she is very fragile and weak to disables, and must be played smartly in order to succeed.",
      "Summary":"Akasha the Queen of Pain is a ranged intelligence hero who uses her abilities to close in and deal huge area damage to the enemy. She is typically played in the middle lane as a ganker and semi-carry, with her ability to appear in battle and deal damage in quick succession, as well as hunt down fleeing heroes with ease. Her Blink ability is the lynchpin of her skill set, allowing her to enter and leave fights at her whim. Once in position to attack, Akasha can unleash her Scream of Pain and Sonic Wave, able to devastate an entire team at once. Chasing down straggling prey is another of her fortes, with Shadow Strike crippling their ability to escape. Akasha is very adept at getting kills early in the game, and transitions very well into a semi-carry if she acquires the proper items.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 57,
        "MinDmg": 49,
        "HP": 484,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.52,
        "Range": 550,
        "ProjectileSpeed": 1500,
        "BaseStr": 16,
        "BaseAgi": 18,
        "BaseInt": 24,
        "StrGain": 1.7,
        "AgiGain": 2,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.6,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.56,
        "AttackSwing": 0.41,
        "CastPoint": 0.452,
        "CastSwing": 1.008,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 86,
      "Name": "Death Prophet",
      "imgURL": "./img/Death_Prophet_icon.png",
      "Info": "Death Prophet is a powerful spell-caster, who has wide Area of Effect (AoE) spells which specialize in pushing lanes and also devastating enemy defensive towers quickly in order to enter their enemy base, to gain victory within a short period of time.",
      "Summary":"Krobelus, the Death Prophet, is a ranged intelligence hero who excels at pushing lanes. She is often played in the mid lane, since her Crypt Swarm gives her strong magic damage that can be spammed to her heart's content. As she levels her ultimate, Exorcism, Death Prophet can deal a huge amount of damage to towers and heroes alike, while healing at the end of the duration. If Exorcism's own heal isn't enough, she still has Spirit Siphon which drains health based on the target's health and can even be used on multiple targets at the same time. Finally, her Silence gives her a powerful tool to disable enemy casters and heroes that rely on escape abilities. Because she can deal large amounts of damage over time with her ultimate and Crypt Swarm, Death Prophet is mostly built as a tank, to ensure she can continue to stay in the fight.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 310,
        "MaxDmg": 56,
        "MinDmg": 44,
        "HP": 541,
        "Mana": 260,
        "HPRegen": 0.75,
        "ManaRegen": 0.01,
        "Armor": 2.96,
        "Range": 600,
        "ProjectileSpeed": 1000,
        "BaseStr": 19,
        "BaseAgi": 14,
        "BaseInt": 23,
        "StrGain": 1.9,
        "AgiGain": 1.4,
        "IntGain": 3,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.56,
        "AttackSwing": 0.51,
        "CastPoint": 0.5,
        "CastSwing": 0.83,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 87,
      "Name": "Pugna",
      "imgURL": "./img/Pugna_icon.png",
      "Info": "Pugna is a caster whose abilities provide strong nuking power and utility in various situations. He offers strong teamfight contribution and can push and counter-push effectively with his nukes.",
      "Summary":"Pugna is a ranged intelligence hero whose spells give him powerful nuking and pushing capability. Nether Blast is a delayed low-cooldown area nuke which also deals damage to buildings, allowing Pugna to use it as a basic nuke as well as a pushing spell. Decrepify is a unit-targeted spell that gives its target the ethereal status effect, rendering them unable to take physical damage but also slowing them and decreasing their magic resistance. Nether Ward is a ward-type ability that debilitates enemy casting, degenerating their mana while punishing them with powerful nukes based on the mana cost of the spells they cast within its domain. Pugna's ultimate ability, Life Drain, is a channeling ability which saps enemy health and grants it to himself, and can be cast on allies to give them health and mana as well. With a strong array of versatile nukes, Pugna can be a force to be reckoned with in teamfights, able to blast his foes into Oblivion with ease.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 330,
        "MaxDmg": 53,
        "MinDmg": 45,
        "HP": 503,
        "Mana": 338,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 16,
        "BaseInt": 26,
        "StrGain": 1.2,
        "AgiGain": 1,
        "IntGain": 4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0.2,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 88,
      "Name": "Dazzle",
      "imgURL": "./img/Dazzle_icon.png",
      "Info": "Dazzle is a support hero most well known for his ability to save his teammates from death using Shallow Grave  as well as his physical damage-focused spells. He can slow and later stun single targets with Poison Touch, heal and harm with Shadow Wave.",
      "Summary":"Dazzle the Shadow Priest is a ranged intelligence Hero known for his ability to heal and protect his teammates while preventing their deaths. Unlike most other supports, his spells revolve around dealing physical damage, allowing his abilities to scale into the late game. His first ability, Poison Touch, is a spammable spell that greatly slows its target and then deals damage over time; out of all his abilities, Poison Touch is the only one that cannot pierce spell immunity. Shallow Grave prevents the target ally from dying under almost any circumstances for the next five seconds, allowing his teammates to survive impossible situations. Though it only prevents fatal damage and not disables such as stuns, it cannot be purged. Shadow Wave is a low-cooldown chain healing ability that deals damage to nearby enemies for each instance of healing, potentially allowing it to deal tremendous physical damage to enemies that are surrounded by Dazzle's allies. His ultimate, Weave, is a large armor bending ability that not only increases his allies' armor, but also decreases his enemies'. Possessing the ability to warp light and dark with his spells, Dazzle is a potent support hero who can prevent his allies from falling to the Nothl Realm, while hastening his foes' demise.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 305,
        "MaxDmg": 59,
        "MinDmg": 41,
        "HP": 484,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.94,
        "Range": 550,
        "ProjectileSpeed": 1200,
        "BaseStr": 16,
        "BaseAgi": 21,
        "BaseInt": 27,
        "StrGain": 1.85,
        "AgiGain": 1.7,
        "IntGain": 3.4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.3,
        "CastSwing": 0.5,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 89,
      "Name": "Leshrac",
      "imgURL": "./img/Leshrac_icon.png",
      "Info": "Leshrac is renowned as one of the strongest nukers in the game, who is capable of putting out tremendous amounts of area magical damage in order to destroy his foes. These nukes are strong at killing both heroes and creeps, making Leshrac a powerful foe in teamfights.",
      "Summary":"Leshrac, the Tormented Soul, is a ranged intelligence hero who is known for his ability to put out a tremendous amount of area magical damage. His array of spells makes him a dangerous foe to stand around, as he can disable and nuke down anyone who dares to stand against him. Split Earth is an area stun that, after a delay, will stun all enemies in its radius while dealing damage. Diabolic Edict is a damage-over-time spell that deals physical damage, corroding all enemies near Leshrac. Unlike most other spells, it can also affect buildings, making Leshrac a very powerful tower killer who can push very effectively. Lightning Storm is a targeted nuke that damages and slows enemies as it jumps from foe to foe, easily clearing away creeps. His ultimate, Pulse Nova, deals magical damage in an area around Leshrac while it is active, making short work of nearby enemies. Few can withstand Leshrac's damage output, as all of his spells combined allow him to scour his foes from the battlefield.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 320,
        "MaxDmg": 45,
        "MinDmg": 41,
        "HP": 484,
        "Mana": 338,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.22,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 16,
        "BaseAgi": 23,
        "BaseInt": 26,
        "StrGain": 1.5,
        "AgiGain": 1.7,
        "IntGain": 3,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.77,
        "CastPoint": 0.7,
        "CastSwing": 0.8,
        "Turnrate": 0.5,
        "Legs": 4
      }
    },
    {
      "ID": 90,
      "Name": "Dark Seer",
      "imgURL": "./img/Dark_Seer_icon.png",
      "Info": "Dark Seer is a semi-support hero, most focused on AoE Battles. He is able to farm safely due to Ion Shell which can also be used to damage his enemies. He can make himself and his allies reach incredible speeds with Surge, along with using Vacuum and Wall of Replica.",
      "Summary":"Ish'kafel, the Dark Seer, is a melee intelligence hero with versatile abilities that allow him to assist allies and greatly change the conditions of combat. His Vacuum in particular affects enemies in a large area and is a powerful crowd-control. It not only disorients and damages enemies, but also pushes them into a small area to follow up with area spells or to trigger other abilities, such as his Wall of Replica ultimate that turns the very power of enemies against them in the form of illusions that replicate their statistics. His other spells focus on buffing allies with speed, or in the case of his Ion Shell, granting an aura that radiates damage onto enemies who venture within it.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 300,
        "MaxDmg": 66,
        "MinDmg": 60,
        "HP": 598,
        "Mana": 377,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 6.68,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 12,
        "BaseInt": 25,
        "StrGain": 2.3,
        "AgiGain": 1.2,
        "IntGain": 2.7,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.59,
        "AttackSwing": 0.58,
        "CastPoint": 0.4,
        "CastSwing": 0.67,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 91,
      "Name": "Batrider",
      "imgURL": "./img/Batrider_icon.png",
      "Info": "Batrider is an intelligence hero mostly played in the offlane role, although sometimes played by professional players as a mid hero. Batrider is most focused on disrupting the enemy team's positioning and isolating enemies",
      "Summary":"Batrider is a ranged intelligence hero who excels in lane control and harassing enemies, especially in the early phase of the game. Usually, Batrider is played as a heavy support, items are not needed to utilize his abilities. Batrider is a mobile burst damage raider, capable of dealing enormous amounts of damage on stacks, at a risky close range. Before moving in for the kill, the Batrider hinders his targets with Sticky Napalm, a stacking debuff ability that slows his enemies and amplifies the damage taken from Batrider himself, be it with attacks, spells, or items. When his enemies are greatly crippled, he is ready to attack. With Flamebreak, he launches an explosive cocktail which damages and knocks back enemies in a targeted area. Then, the Batrider activates his Firefly ability, allowing the Batrider to fly high in the sky, creating a burning trail of liquid fire, scorching enemies who dare to go in his path, while giving him the ability to cross and phase through impassable grounds. With Sticky Napalm stacked, he is capable of amplifying and inflicting massive damage quickly, burning them with Flamebreak and Firefly. The Batrider then uses his ultimate, Flaming Lasso, which catches a target with a lasso, shackling and pulling them to his Firefly trail or to the clutches of his merciless allies. When these spells are used altogether, the Batrider is a dangerous hero that the enemy should be aware of, risking his own safety enough to cause fiery chaos and mass destruction.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 290,
        "MaxDmg": 42,
        "MinDmg": 38,
        "HP": 598,
        "Mana": 312,
        "HPRegen": 0.2,
        "ManaRegen": 0.01,
        "Armor": 2.1,
        "Range": 375,
        "ProjectileSpeed": 900,
        "BaseStr": 22,
        "BaseAgi": 15,
        "BaseInt": 24,
        "StrGain": 2.4,
        "AgiGain": 1.5,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1400,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.54,
        "CastPoint": 0.2,
        "CastSwing": 0.7,
        "Turnrate": 1,
        "Legs": 0
      }
    },
    {
      "ID": 92,
      "Name": "Ancient Apparition",
      "imgURL": "./img/Ancient_Apparition_icon.png",
      "Info": "Ancient Apparition is a spellcaster hero whose abilities can empower, disable and destroys with the power of ice. His ultimate, Ice Blast allows him to damage & freeze his foes' health regeneration, placing them on disadvantages during every teamfight, thus making him scale very well into the game.",
      "Summary":"Kaldr, the Ancient Apparition, is a ranged intelligence hero who is most commonly played as a support. Though very frail, this icy elemental caster possesses great range on his spells (including an ultimate that can be used anywhere on the map), and strong semi-spammable spells. Cold Feet places a debuff on an enemy which will stun the unit unless it leaves the area the skill was cast. This can be devastating when used in conjunction with other disables from allies. Ice Vortex is a spammable zoning ability, applying a heavy slow and magic damage amplification to all enemies standing near the vortex. This is great in combination with Chilling Touch, which buffs Kaldr and his allies with enhanced magic damage for several regular attacks. His ultimate, Ice Blast, is an area-of-effect ultimate and one of the most devastating spells in the game as it has a global range and increases in radius the further the blast lands from the Ancient Apparition. Enemies struck by the blast will take hefty damage, have their health regeneration completely frozen for a respectable duration, and are killed instantly if they fall too low on life, making the Ancient Apparition an excellent counter to heroes who rely on sustaining themselves in teamfights through healing and regeneration.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 54,
        "MinDmg": 44,
        "HP": 522,
        "Mana": 325,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 600,
        "ProjectileSpeed": 1250,
        "BaseStr": 18,
        "BaseAgi": 20,
        "BaseInt": 25,
        "StrGain": 1.4,
        "AgiGain": 2.2,
        "IntGain": 2.6,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.45,
        "AttackSwing": 0.3,
        "CastPoint": 0.01,
        "CastSwing": 0.75,
        "Turnrate": 0.6,
        "Legs": 0
      }
    },
    {
      "ID": 93,
      "Name": "Invoker",
      "imgURL": "./img/Invoker_icon.png",
      "Info": "Invoker is one of the most difficult to learn heroes in the game, but also one of the most flexible and powerful casters. As such, his skill floor is not impossibly high, however, his skill ceiling is almost unparalleled, and thus he takes significant amounts of practice in order to learn.",
      "Summary":"Invoker is a ranged intelligence hero who is very difficult to master. He is unique in that he possesses a total of 14 abilities in his arsenal; three of them - Quas, Wex, and Exort - are reagents and one is his special ultimate Invoke. The three abilities he learns throughout leveling up can have three instances, which serve as the basic ingredients or components for him to create a new ability using his ultimate. Once the reagents or elements are combined, he can invoke one out of ten different abilities. All of his invoked abilities are capable of a multitude of actions, from damaging enemies to aiding his allies, and even saving himself from danger. His three reagents can be upgraded up to level 7 which determines the power and potency of his invoked abilities, making it more powerful than an ordinary spell. Because of this, he can be played in almost any role possible. Invoker can be a carry, semi-carry, ganker, pusher, initiator or even support. His three reagents provide a passive bonus per instance, allowing for specialization at early levels and situational boosts at later levels. His extremely flexible nature allows him to use many different combinations of items effectively but also make him dependent on solid builds and a good gold advantage.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 280,
        "MaxDmg": 41,
        "MinDmg": 35,
        "HP": 541,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.8,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 20,
        "BaseInt": 22,
        "StrGain": 1.7,
        "AgiGain": 1.9,
        "IntGain": 4,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.7,
        "CastPoint": 0,
        "CastSwing": 0,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 94,
      "Name": "Outworld Devourer",
      "imgURL": "./img/Outworld_Devourer_icon.png",
      "Info": "Outworld Devourer is a carry and a disabler. He is one of the few damage dealers who can also reset fights, break chain stuns, and save teammates thanks to his Astral Imprisonment. He is also one of the few heroes who can reliably deal pure damage thanks to Arcane Orb.",
      "Summary":"Harbinger, the Outworld Devourer, is a ranged intelligence hero who qualifies as a carry, though unlike traditional carries, he excels against high-armor targets whilst being crippled by spell immunity. With Arcane Orb, his damage output is reliant on his intelligence attribute and the size of his mana pool, so he must focus more or less exclusively on items which augment them. Though he lacks somewhat in range and has no innate mobility skills, Arcane Orb deals Pure damage and steals intelligence, meaning that if he gains an advantage in a match he deals constant, colossal damage which cannot be decreased or resisted except with total spell immunity and gets stronger with each hit. He and his allies enjoy more-or-less unlimited mana because of his Essence Aura, which gives them a chance to replenish a percentage of their mana upon casting a spell. With Astral Imprisonment, Harbinger can render himself or an ally invulnerable for a short period of time, or disable the target enemy. His ultimate, Sanity's Eclipse, can instantly deal colossal area-of-effect damage against his enemies based on how much greater his intelligence is than theirs.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 61,
        "MinDmg": 46,
        "HP": 541,
        "Mana": 338,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 5.36,
        "Range": 450,
        "ProjectileSpeed": 900,
        "BaseStr": 19,
        "BaseAgi": 24,
        "BaseInt": 26,
        "StrGain": 2.3,
        "AgiGain": 2,
        "IntGain": 3.3,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.54,
        "CastPoint": 0.25,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 95,
      "Name": "Shadow Demon",
      "imgURL": "./img/Shadow_Demon_icon.png",
      "Info": "Shadow Demon is an excellent defensive support capable of resetting fights, counter-initiating, and dealing with blinks and spell immunity. His Disruption works well as a way to break up chain stuns and to set up an ally's stun.",
      "Summary":"Shadow Demon is a menacing ranged intelligence hero who is most powerful in the early game for his strong set of spells. Disruption takes an enemy or ally out of the fight, banishing them to a shadowy realm and returning them a short time later along with two hostile demonic illusions. Soul Catcher can curse his victims with vulnerability, causing them to take more damage from attacks and spells. His Shadow Poison can harass any unfortunate foe he encounters, gradually dealing more damage with each application until the Shadow Demon releases the poison from the target in a powerful, damaging burst. Demonic Purge, his ultimate, is key for securing kills: The Shadow Demon greatly slows his fleeing victim and removes all purgeable buffs, crippling and weakening them, while also (when upgraded with Aghanim's Scepter) applying a Break that disables almost all passive skills. Heavily reliant on the coordination and effectiveness of his own team, Shadow Demon proves to be incredibly strong as a defensive support by keeping his teammates alive reliably and as an offensive support by amplifying damage and endlessly slowing enemies until they're unable to escape. A formidable ally, who requires little farm to contribute greatly to his team, good positioning and timing from Shadow Demon's spells can make all the difference, and makes for one of the most potentially powerful supports well into the late game.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 54,
        "MinDmg": 50,
        "HP": 503,
        "Mana": 338,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.52,
        "Range": 500,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 18,
        "BaseInt": 23,
        "StrGain": 1.9,
        "AgiGain": 2.2,
        "IntGain": 2.7,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.36,
        "AttackSwing": 0.5,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 96,
      "Name": "Visage",
      "imgURL": "./img/Visage_icon.png",
      "Info": "Visage is a highly flexible Hero, able to push and gank very effectively, packing within his abilities a massive nuke with very low cooldown and one powerful slow, useful for taking down enemies when ganking. ",
      "Summary":"Visage, the bound form of Necro'lic, is a ranged intelligence hero whose traits are unusual when compared to most intelligence heroes; he can be a ganker, tank, or nuker. Resilient and ruthless, Visage is a highly aggressive hero thanks to his great Strength gain and Gravekeeper's Cloak which allow him to soak up surprising amounts of damage. This is especially true from attacks mounted by Heroes who try to chip at his health with spells and burst damage without committing to a protracted engagement. This unholy gargoyle thrives in the midst of large battles, where the abundant pain and suffering in the air charges his Soul Assumption, allowing him to fire off huge bursts of magical damage in rapid succession. Additionally, Visage's proficiency with auto-attacks is augmented by his ability to absorb the attack and movement speed of his foes with Grave Chill. Finally, his versatile ultimate, Familiars, is arguably one of the best scouting utilities in the game while also being excellent sources of damage and AoE disables. Utilizing his Familiars to their fullest requires constant split attention and good positioning to avoid feeding their large bounties to an enemy Hero. With a legion of ghostly gargoyles, incredible toughness, and fast attacks, Visage sows terror and agony, relentlessly hunting poor souls and leading them in the shackles of death to the gates of the Underscape.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 285,
        "MaxDmg": 55,
        "MinDmg": 45,
        "HP": 598,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": -0.46,
        "Range": 600,
        "ProjectileSpeed": 900,
        "BaseStr": 22,
        "BaseAgi": 11,
        "BaseInt": 24,
        "StrGain": 2.4,
        "AgiGain": 1.3,
        "IntGain": 2.5,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.54,
        "CastPoint": 0.4,
        "CastSwing": 1.1,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 97,
      "Name": "Troll Warlord",
      "imgURL": "./img/Troll_Warlord_icon.png",
      "Info": " Troll Warlord is one of the strongest hard carries in the whole game. His signature ability, Berserker's Rage, allows him to switch between melee and ranged autoattacks, both with their pros and cons. He is most devastating in a one vs. one situation.",
      "Summary":"Jah'rakal the Troll Warlord is a ranged Agility hero able to output mighty damage competitively at range and in melee. His Berserker's Rage gives him the unique ability to change his attack position from ranged to melee and back at will as the situation warrants. When in close combat, his stats are increased accordingly: he gains bonus armor, movement speed, reduced base attack time, and the ability to Bash. Not only does this greatly improve the Troll Warlord, but allows him to overpower most other carries, as well as permabash a target for extended amounts of time. The Troll Warlord is an axe specialist, using them in his unique Whirling Axes. Whirling Axes has two variations: the first is available to his ranged form wherein he throws five axes in a cone formation to damage and slow enemies down. The second is available to his melee form, unleashing axes around himself in a small radius to damage and blind nearby enemies. In keeping with his savage nature, Fervor builds up the Warlord's momentum. With each consecutive hit on the same target, he gains increased attack speed, up to a maximum of 7 stacks. His Ultimate, Battle Trance, increases the attack speed of all of his allies globally, making it useful both for teamfights and to shred towers down quickly. Notorious for his superbly fast attack speed that can be matched by few, Jah'rakal is truly a force to be reckoned with.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 56,
        "MinDmg": 38,
        "HP": 503,
        "Mana": 169,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.94,
        "Range": 500,
        "ProjectileSpeed": 1200,
        "BaseStr": 17,
        "BaseAgi": 21,
        "BaseInt": 13,
        "StrGain": 2.2,
        "AgiGain": 2.75,
        "IntGain": 1,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.51,
        "CastSwing": 0.3,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 98,
      "Name": "Tusk",
      "imgURL": "./img/Tusk_icon.png",
      "Info": "Tusk is a very strong initiator who can set up fights on his team's terms. His arsenal of crowd control spells can greatly inhibit enemies during fights and ganks, giving allies a powerful edge. Tusk is a ganking specialist as he can hunt fragile heroes throughout the game.",
      "Summary":"Ymir, the Tusk, is a melee strength hero whose array of icy disables make him a very strong team initiator and ganker. He has a damage nuke and a disable in Ice Shards, which lets him precisely place a barrier in an enemy's path, inhibiting their movement and blocking off their escape path. Should his teammates need help closing the distance to enemies, Tusk can assist them with Snowball, which surrounds Tusk and any nearby allies in a protective shell of snow as he rolls at a target enemy, damaging and stunning everything in its path. Once in a fight, Tusk can slow the enemy down to his pace with Frozen Sigil, which reduces the movement and attack speed of all nearby foes. His ultimate, Walrus PUNCH!, sends a target enemy flying with a mighty uppercut, stunning and disabling them while dealing tremendous damage, and slowing them upon landing. A strong initiator and powerful brawler, the Terror from the Barrier should never be bet against in a fight, as he can put his foes down for the count with his unique assortment of spells and disables.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 54,
        "MinDmg": 50,
        "HP": 617,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.22,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 23,
        "BaseInt": 18,
        "StrGain": 2.3,
        "AgiGain": 2.1,
        "IntGain": 1.7,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.36,
        "AttackSwing": 0.64,
        "CastPoint": 0.1,
        "CastSwing": 1,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 99,
      "Name": "Bristleback",
      "imgURL": "./img/Bristleback_icon.png",
      "Info": "Bristleback is a very good tank not only because of his formidable health pool, but also because of one of his abilities Bristleback, making him more durable when fighting with his back against his enemy.",
      "Summary":"Rigwarl the Bristleback is a melee strength hero famous for his array of synergistic, simplistic, and yet effective spells with low mana costs and cooldowns. Though each cast of his spells has relatively weak potency on its own, their instances have a cumulative effect, making the Bristleback quite deadly the longer he stays alive in a fight; this is directly reflected in his ultimate, Warpath, which powers up his movement and attack damage based on the number of spells he recently cast. He is able to increasingly slow his enemies down and reduce their armor with Viscous Nasal Goo and hit them with a barrage of Quill Sprays, making him an effective chaser when ganking enemies. His low strength gain makes him seem less tanky than most strength heroes at first glance, but his signature Bristleback passive substantially reduces all damage he takes from the sides and especially the rear, making him very difficult to bring down if he's facing away from his enemies. In the right hands, Bristleback is a powerful ganker in the early stages of the game, and a powerful hard carry in the later stages depending on how much farm he gets.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 290,
        "MaxDmg": 58,
        "MinDmg": 48,
        "HP": 598,
        "Mana": 182,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.38,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 22,
        "BaseAgi": 17,
        "BaseInt": 14,
        "StrGain": 2.2,
        "AgiGain": 1.8,
        "IntGain": 2.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.8,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.3,
        "CastPoint": 0.4,
        "CastSwing": 0.51,
        "Turnrate": 1,
        "Legs": 2
      }
    },
    {
      "ID": 100,
      "Name": "Skywrath Mage",
      "imgURL": "./img/Skywrath_Mage_icon.png",
      "Info": "Skywrath Mage is a very strong nuker whose spells allow him to deal tremendous amounts of magic damage to enemy heroes. If left uninterrupted, he is a force to be reckoned with and is capable of destroying enemy heroes by himself.",
      "Summary":"Dragonus, the Skywrath Mage, is a ranged intelligence hero equipped with tremendously powerful nukes, able to enhance magical damage and thus scales well into late game. However, he is a proverbial glass cannon; while he can bring superb amounts of damage, he is dangerously vulnerable and will most likely meet a swift end if the player isn't careful. Arcane Bolt is his main spell; its damage is based on his current Intelligence level. Concussive Shot blasts the nearest enemy hero, along with nearby units around the foe, slowing them down. The Ancient Seal marks the target with magic amplification and silence, leaving the target vulnerable to magic and unable to cast spells. Skywrath Mage's ultimate Mystic Flare is one of the most dangerous nukes in the game. Enemy heroes caught in this field will suffer massive damage. Its power is split equally among enemy heroes within its radius; if it is used on a single hero, it will deal its full damage potential. His spells are most effective when targeted on a lone hero and thus suffer decreased effectiveness when used on groups.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 325,
        "MaxDmg": 49,
        "MinDmg": 39,
        "HP": 541,
        "Mana": 351,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": -0.18,
        "Range": 600,
        "ProjectileSpeed": 1000,
        "BaseStr": 19,
        "BaseAgi": 13,
        "BaseInt": 27,
        "StrGain": 1.5,
        "AgiGain": 0.8,
        "IntGain": 3.6,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.78,
        "CastPoint": 0.1,
        "CastSwing": 1.08,
        "Turnrate": 0.5,
        "Legs": 0
      }
    },
    {
      "ID": 101,
      "Name": "Elder Titan",
      "imgURL": "./img/Elder_Titan_icon.png",
      "Info": "Elder Titan is a very flexible hero who can provide great amounts of utility to his team through his abilities, depending on how he is built. He can use Astral Spirit to accrue great amounts of bonus damage and movement speed.",
      "Sumamry":"The Elder Titan is a melee strength hero who is renowned as a powerful area nuker and disabler. Elder Titan is perhaps best known for his ability Astral Spirit, which sends forth an image of himself that damages enemies that it passes through, and upon returning to Elder Titan boosts his attack damage and movement speed, making him a fearsome melee fighter. Possessing a channeled sleep in Echo Stomp, Elder Titan is also capable of knocking out his foes for an extended period of time if they are caught within its radius; Astral Spirit also allows him to cast this ability and disable large groups of enemies from afar, making him one of the few initiators that does not require a Blink Dagger. This combination creates a perfect setup for his powerful ultimate Earth Splitter, which damages enemies based on their maximum HP and slows their movement speed. This, along with his ability to lower his enemies' physical and magical resistance with his Natural Order aura, makes Elder Titan scale well through his abilities and be effective at all stages of the game. As the progenitor of this world, Elder Titan reshapes the battlefield on a whim and can turn any teamfight in his favor.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 315,
        "MaxDmg": 57,
        "MinDmg": 47,
        "HP": 636,
        "Mana": 299,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.96,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 24,
        "BaseAgi": 14,
        "BaseInt": 23,
        "StrGain": 2.3,
        "AgiGain": 1.5,
        "IntGain": 1.6,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.97,
        "CastPoint": 0.4,
        "CastSwing": 0.8,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 102,
      "Name": "Abaddon",
      "imgURL": "./img/Abaddon_icon.png",
      "Info": " Abaddon is versatile hero who specializes in absorbing damage and shielding his teammates. Unlike other supports, Borrowed Time allows Abaddon to be in the middle of the fight, converting heavy attacks back into health.",
      "Summary":"Abaddon, the Lord of Avernus, is a melee strength hero known as one of the most versatile characters in Dota due to his rather low mana dependence, short spell cooldowns and a large number of viable item choices. His ability to help sustain his allies and himself plus his strong tower diving capacity give him solid lane presence. Many of his abilities offer a large sum of utility, which makes him a strong support Hero. Mist Coil serves as both a single target nuke and heal that helps shift the sustainability of both allied and enemy heroes in a lane at his will, though sacrificing a portion of his own health. Aphotic Shield holds as one of the most useful abilities in the game, able to shield a target from some damage while also able to reflect said damage to a huge area. The most important aspect is how it is able to dispel many status effects such as slows and stuns. His other abilities allow him to become a mix between a semi-carry and tank. Abaddon's passive, Curse of Avernus, allows his attacks to not only slow down his enemy, but also increase the attack and movement speed of any ally attacking the same target. With his ultimate, Borrowed Time, Abaddon is able to shift all non-HP removal damage he receives into health. When not on cooldown, Borrowed Time may activate passively when his health falls under a certain threshold, even under the most dire situations. Due to his powerful spells and versatility, Abaddon is an excellent addition to any team.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 310,
        "MaxDmg": 65,
        "MinDmg": 55,
        "HP": 617,
        "Mana": 273,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.38,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 23,
        "BaseAgi": 17,
        "BaseInt": 21,
        "StrGain": 2.7,
        "AgiGain": 1.5,
        "IntGain": 2,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.56,
        "AttackSwing": 0.41,
        "CastPoint": 0.452,
        "CastSwing": 1.008,
        "Turnrate": 0.6,
        "Legs": 6
      }
    },
    {
      "ID": 103,
      "Name": "Earth Spirit",
      "imgURL": "./img/Earth_Spirit_icon.png",
      "Info": "Earth Spirit is one of the strongest disabling heroes in the game, possessing a stun, silence, and slow in all of his basic abilities, allowing him to combo his abilities based on the needs of his allies and how he wants to affect his enemies.",
      "Summary":"Kaolin the Earth Spirit is a melee strength hero with great utility, possessing a wide array of disables in all of his basic abilities. Unlike most heroes, his abilities revolve around an innate ability, Stone Remnant, which allows him to place statues that can be used to augment his abilities. Using his abilities in tandem with these remnants, Earth Spirit can stun enemies with Boulder Smash, slow them and initiate with Rolling Boulder, and silence them with Geomagnetic Grip. His ultimate, Magnetize, inflicts nearby enemies with a damage over time debuff, and allows him to spread the slow and silence from his abilities to other nearby enemies while refreshing the debuff duration by using his Stone Remnants, stopping entire groups of enemies in their tracks. With good timing and skill he can initiate fights from a distance, and given the right circumstances can deal a surprising amount of damage to both single and multiple targets, all the while disrupting enemy positioning allowing for easy kills. A useful ally and a dangerous enemy, the Earth Spirit's versatility and flexibility make him an ideal hero in almost any lineup or lane.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 56,
        "MinDmg": 46,
        "HP": 579,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 3.38,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 21,
        "BaseAgi": 17,
        "BaseInt": 18,
        "StrGain": 2.9,
        "AgiGain": 1.5,
        "IntGain": 2.1,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.65,
        "CastPoint": 0.01,
        "CastSwing": 0,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 104,
      "Name": "Ember Spirit",
      "imgURL": "./img/Ember_Spirit_icon.png",
      "Info": "Ember Spirit is a very mobile and evasive carry due to his ability to strike from range or dodge enemy attacks using Sleight of Fist and Fire Remnant. Playing Ember Spirit requires quick reflexes, good judgment and an aggressive mindset.",
      "Summary":"Xin, the Ember Spirit, is a highly mobile and versatile melee agility carry, whose abilities make him a very slippery foe and enable him to dance around his enemies at will. His skill set allows for incredibly aggressive assaults on other heroes, as he can engage on them from long range using Sleight of Fist, and tie them down with Searing Chains to halt their movements. His Flame Guard ability deals damage while active and shields Xin from magic nukes, making him a force to be reckoned with by enemy casters. And finally, his Fire Remnant spell allows him to engage, escape or move instantaneously around the map, allowing him to show up where the enemy least expects and disappear just as quickly. Despite a decent health pool early on, he lacks armor and a sizable mana pool, making him quite frail and easy to bring down with physical damage if caught or disabled. However, with good item choices and proper judgment, Ember Spirit can engage his foes using his speed and disables, dominating the battlefield with blinding speed. While he has only a limited presence in the early and mid game, in time Xin becomes a dangerous opponent even on his own, proving to friend and foe alike that for them, there is still much to be learned.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 310,
        "MaxDmg": 56,
        "MinDmg": 52,
        "HP": 541,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.08,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 19,
        "BaseAgi": 22,
        "BaseInt": 20,
        "StrGain": 2,
        "AgiGain": 1.8,
        "IntGain": 1.8,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.4,
        "AttackSwing": 0.3,
        "CastPoint": 0,
        "CastSwing": 0.51,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 105,
      "Name": "Legion Commander",
      "imgURL": "./img/Legion_Commander_icon.png",
      "Info": "Legion Commander is ganking carry whose damage potential is theoretically unlimited. She is able to heal, buff herself and her allies with Press the Attack, and finish off enemies with Overwhelming Odds.",
      "Summary":"Tresdin, the Legion Commander, is a melee strength hero fitting the role of carry. A highly mobile and predatory hero, her skillset and gameplay revolves mainly around successfully killing off targets with her ultimate, Duel. Accomplishing this grants Tresdin permanent bonus damage. Though she is extremely skilled in fair one-on-one fights, Tresdin suffers when outnumbered and must choose her engagements carefully. A successful midgame sees her roaming the map collecting kills and becoming a very dangerous carry, whilst in lategame she ideally will no longer rely on Duel to win her fights and simply destroy any enemies that come too close to her. Though potentially an extremely powerful hero, she must be played with premeditation and good decision-making to reach her full potential.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 320,
        "MaxDmg": 65,
        "MinDmg": 61,
        "HP": 674,
        "Mana": 260,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.52,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 26,
        "BaseAgi": 18,
        "BaseInt": 20,
        "StrGain": 2.6,
        "AgiGain": 1.7,
        "IntGain": 2.2,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.46,
        "AttackSwing": 0.64,
        "CastPoint": 0.3,
        "CastSwing": 0.6,
        "Turnrate": 0.6,
        "Legs": 2
      }
    },
    {
      "ID": 106,
      "Name": "Terrorblade",
      "imgURL": "./img/Terrorblade_icon.png",
      "Info": "Terrorblade is a potent carry who demolishes buildings and heroes alike with his illusions. With Metamorphosis , he transforms into an imposing demon avatar, gaining the ability to deal high damage at range.",
      "Summary":"Terrorblade the Demon Marauder is a melee agility carry hero who is devastating in the later stages of the game. Terrorblade has the highest starting armor in the game, but is squishy due to his low health, meaning he needs strength items to be tanky enough to sustain damage to himself and his illusions. As with all illusion-based heroes, he needs stat-based items in order to make his illusions powerful. He is known for casting Reflection, which creates invulnerable illusions of all nearby enemy Heroes for a few seconds. Conjure Image creates an illusion of Terrorblade that deals considerable damage at max level. Terrorblade can create up to two illusions, which together deal more damage than Terrorblade himself, effectively multiplying Terrorblade's Base Damage (but not his Bonus Damage). Metamorphosis is an unorthodox spell that transforms Terrorblade into a powerful ranged demon capable of wrecking havoc on his enemies with its bonus range and damage, but makes Terrorblade slower. This spell also makes illusions of Terrorblade transform into his demonic form, but they revert back once they wander too far away from Terrorblade. Finally his ultimate, Sunder, is a unique ability that swaps his health with a targeted hero, ally or enemy alike. This makes ganks on him incredibly risky since he can sunder a hero before finishing them off with a few attacks. With his two Illusion-based spells, the 'semi-ultimate' Metamorphosis and his ultimate, Sunder, Terrorblade's skill set makes him a strong foe in the early game and absolutely terrifying at the later stages of the game. He is usually played as a hard carry.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 315,
        "MaxDmg": 54,
        "MinDmg": 48,
        "HP": 465,
        "Mana": 247,
        "HPRegen": 2,
        "ManaRegen": 0.01,
        "Armor": 7.08,
        "Range": 128,
        "ProjectileSpeed": 0,
        "BaseStr": 15,
        "BaseAgi": 22,
        "BaseInt": 19,
        "StrGain": 1.4,
        "AgiGain": 3.2,
        "IntGain": 1.75,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.5,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.6,
        "CastPoint": 0.5,
        "CastSwing": 0.51,
        "Turnrate": 0.5,
        "Legs": 2
      }
    },
    {
      "ID": 107,
      "Name": "Phoenix",
      "imgURL": "./img/Phoenix_icon.png",
      "Info": "Phoenix is a high-risk-high-reward, spell-dependent supportive initiator adept at placing debuffs on a wide area to hamper the enemy team's offensive capabilities and slowly burn their health away.",
      "Summary":"Phoenix is a flexible and unique ranged strength hero with a plethora of powerful abilities that inflict heavy damage over time on its opponents at the cost of its own health. It can be played as either a support, initiator, or semi-carry. Icarus Dive can serve as either a harassment tool, an initiating maneuver, or an escape mechanism, all the while slowing and damaging opponents in its path, while its Fire Spirits burn and cripple the opponent's attack speed, making it a potent anti-carry. Sun Ray projects a powerful beam in front of Phoenix that burns enemies for a percentage of their maximum health while sacrificing some of its own health; and, if it ever sees fit, it can end its current life to turn into a searing Supernova. Surviving this stage of its life cycle allows Phoenix to reemerge in full strength, stunning all nearby opponents and with all cooldowns (except its ultimate) refreshed, ready to inflict havoc on its foes once again.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 285,
        "MaxDmg": 53,
        "MinDmg": 43,
        "HP": 503,
        "Mana": 234,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": -0.32,
        "Range": 500,
        "ProjectileSpeed": 1100,
        "BaseStr": 17,
        "BaseAgi": 12,
        "BaseInt": 18,
        "StrGain": 2.9,
        "AgiGain": 1.3,
        "IntGain": 1.8,
        "PrimaryStat": "STR",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.35,
        "AttackSwing": 0.633,
        "CastPoint": 0.2,
        "CastSwing": 0.5,
        "Turnrate": 1,
        "Legs": 0
      }
    },
    {
      "ID": 108,
      "Name": "Techies",
      "imgURL": "./img/Techies_icon.png",
      "Info": "Techies is an unorthodox hero in the game, as their team contribution comes mainly from placing traps outside of combat rather than engaging enemies in fights. Playing Techies requires good map awareness and game sense in order to know when and where to place traps.",
      "Summary":"Squee, Spleen, and Spoon, the Techies, are a trio of ranged Intelligence heroes, known for laying deadly traps around the field with a wide array of mines. Having little direct combat ability, the Techies have an unorthodox, if effective, method of dealing damage to the enemy team in the form of powerful laid explosive mines and stasis traps that enable other heroes to set up a gank or retreat. Their mines, set across key points of the map -and even less conventional locations- are an effective method of denying area and guaranteeing damage if enemies dare to initiate. They have an even more bizarre ability in the form of their Blast Off! which causes them to violently explode and lose half their life but deal massive damage in a moderate area of effect. The unique mechanics of the mines mean that the Techies utilize mechanics not used by any other hero, including preemptive mine clusters and such strong area denial that they actively play a large role in securing the area controlled by friendly heroes. The Techies have statistics aligned to those of semi-carries, but play a largely passive, defensive role throughout the game.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 270,
        "MaxDmg": 31,
        "MinDmg": 29,
        "HP": 503,
        "Mana": 286,
        "HPRegen": 0.25,
        "ManaRegen": 0.02,
        "Armor": 6.96,
        "Range": 700,
        "ProjectileSpeed": 900,
        "BaseStr": 17,
        "BaseAgi": 14,
        "BaseInt": 22,
        "StrGain": 2,
        "AgiGain": 1.3,
        "IntGain": 2.9,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.5,
        "AttackSwing": 0.5,
        "CastPoint": 0,
        "CastSwing": 0.61,
        "Turnrate": 0.5,
        "Legs": 6
      }
    },
    {
      "ID": 109,
      "Name": "Oracle",
      "imgURL": "./img/Oracle_icon.png",
      "Info": "Oracle is a versatile spell caster who can use abilities defensively or offensively depending on different combinations of abilities. A well timed False Promise may change a surprise attack from the enemy into a failed gank.",
      "Summary":"Nerif, the Oracle, is a ranged intelligence hero who alters the fate of allies and enemies with his combination of multipurpose nukes and buffs. He possesses the ability to change his foes' fortunes with Fortune's End, which deals nuke damage and pins down any enemies in its radius, while removing any purgeable buffs from them. His Fate's Edict can be cast on allies and enemies alike, disarming them but also granting them complete resistance against magical damage; used with skill, he can render his foes' weapons useless or shield his allies from unfriendly spells. Purifying Flames, like Fate's Edict, can be cast on friend or foe, dealing magical damage but also applying a healing buff to them. His signature ability and ultimate, False Promise, puts an ally's fate on hold, preventing them from being disabled or harmed by the enemy for a short time, and then fully returning them to reality at the end of the spell's duration. Knowledge of Oracle's skills is key to use him at his full potential; while he can defy destiny and snatch victory from the jaws of defeat, one mistake can potentially seal the fate of his allies.",
      "Stats": {
        "Alignment": "Radiant",
        "Movespeed": 305,
        "MaxDmg": 51,
        "MinDmg": 45,
        "HP": 522,
        "Mana": 299,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 2.1,
        "Range": 620,
        "ProjectileSpeed": 900,
        "BaseStr": 18,
        "BaseAgi": 15,
        "BaseInt": 23,
        "StrGain": 1.9,
        "AgiGain": 1.7,
        "IntGain": 2.9,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.4,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.83,
        "Turnrate": 0.4,
        "Legs": 2
      }
    },
    {
      "ID": 110,
      "Name": "Winter Wyvern",
      "imgURL": "./img/Winter_Wyvern_icon.png",
      "Info": "Winter Wyvern Winter Wyvern is a powerful nuker who also provides utility in her spells, making her a well-rounded support. As she does not require gold in order to be effective, she is well-suited to playing as a hard support, protecting her safe lane carry with Cold Embrace.",
      "Summary":"Auroth, the Winter Wyvern, is a ranged intelligence hero whose arsenal of spells gives her powerful nuking capabilities. Usually played as a lane support, Winter Wyvern's spells allow her to fulfill a myriad of roles depending on what her team needs. Arctic Burn grants her temporarily flying movement, increased attack range as well as night vision while causing her attacks to slow enemies and burn their health over time, allowing her to gank and harass with ease. Splinter Blast is a low-cooldown nuke that, while leaving its target unaffected, slows and deals tremendous damage to all other nearby enemies. Cold Embrace allows Winter Wyvern to encase a target ally within a protective layer of ice, disabling them for the duration of the spell but also rendering them immune to physical damage while healing them for a percentage of their maximum health. Her ultimate, Winter's Curse, turns the enemies' own weapons against them by stunning the target enemy while forcing all of their nearby allies to attack them. A fearsome ganker and powerful nuker, Winter Wyvern can chill her foes to the bone and wreak havoc on their ranks.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 285,
        "MaxDmg": 45,
        "MinDmg": 38,
        "HP": 636,
        "Mana": 325,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 1.24,
        "Range": 425,
        "ProjectileSpeed": 700,
        "BaseStr": 24,
        "BaseAgi": 16,
        "BaseInt": 25,
        "StrGain": 2.1,
        "AgiGain": 1.9,
        "IntGain": 3.1,
        "PrimaryStat": "INT",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.25,
        "AttackSwing": 0.8,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 0
      }
    },
    {
      "ID": 111,
      "Name": "Arc Warden",
      "imgURL": "./img/Arc_Warden_icon.png",
      "Info": "Arc Warden is a carry that can nuke enemies early and then split push to end the game. His health, armor, and mana early on are fairly low, but they still give him enough to last in lane and nuke foes with his combo.",
      "Summary":"Zet, the Arc Warden, is a ranged agility hero that requires micromanagement and farm to spiral out of control. In the early stages of the game, it is a very powerful nuker. Its first ability, Flux, allows Arc Warden to cripple an enemy down and deal large amounts of damage. It and other allied heroes or buildings can be protected from physical attacks with its second ability Magnetic Field, while gaining swift attack speed. Similar to Techies' Land Mines, Arc Warden's third ability, Spark Wraith, allows it to place wraiths that attack when an enemy goes near them, potentially dealing large amounts of magical damage. Finally, thanks to its ultimate, Tempest Double, which allows it to make a perfect copy of itself that can use all of Arc Warden's spells and item abilities, it can spam all of its other abilities and most items twice and easily take down fragile heroes in the early game, or keep itself or its team doubly sustained through certain buffing or healing items. This makes Arc Warden very powerful in both early and late game if given enough farm, from magical nuker to physical carry, or if the time calls it, a very potent support.",
      "Stats": {
        "Alignment": "Dire",
        "Movespeed": 295,
        "MaxDmg": 50,
        "MinDmg": 40,
        "HP": 636,
        "Mana": 312,
        "HPRegen": 0.25,
        "ManaRegen": 0.01,
        "Armor": 0.1,
        "Range": 625,
        "ProjectileSpeed": 800,
        "BaseStr": 24,
        "BaseAgi": 15,
        "BaseInt": 24,
        "StrGain": 1.9,
        "AgiGain": 1.8,
        "IntGain": 2.1,
        "PrimaryStat": "AGI",
        "BaseAttackTime": 1.7,
        "DayVision": 1800,
        "NightVision": 800,
        "AttackPoint": 0.3,
        "AttackSwing": 0.7,
        "CastPoint": 0.3,
        "CastSwing": 0.51,
        "Turnrate": 0.4,
        "Legs": 2
      }
    }
]
}
